{
  "scraping_info": {
    "base_url": "https://solana.com/",
    "total_pages": 30,
    "failed_urls": 0,
    "scraped_at": "2025-07-12 22:05:55"
  },
  "pages": {
    "https://solana.com/": {
      "url": "https://solana.com/",
      "title": "Web3 Infrastructure for Everyone | Solana",
      "description": "Fast. Decentralized. Scalable. Energy efficient. Solana can power thousands of transactions per second.",
      "content": "Web3 Infrastructure for Everyone | SolanaLearnDevelopersSolutionsNetworkCommunitySearchPowerful for developers. Fast for everyone.Bring blockchain to the people. Solana supports experiences for power users, new consumers, and everyone in between.Start BuildingResourcesPowering tools and integrations from companies all around the worldPAYMENTSSolana Ecosystem Announces 'Onchain Holiday'Introducing Onchain Holiday: an online Solana-powered shopping event running from that allows users to spend their stablecoins and memecoins on merchandise from over a dozen brands and retailers.Learn more - Solana Ecosystem Announces 'Onchain Holiday'NEWSSolana Accelerate brings together 3000+ founders, devs, and policymakers in NYCWatch any talk you missed on YouTube covering the latest in crypto product and policy in America.Watch - Solana Accelerate brings together 3000+ founders, devs, and policymakers in NYCDEVELOPERSSolana Attestation Service is now liveLearn how to privately verify off-chain data associated with any wallet using the new open source, permissionless protocol to attest to anything in this blog from the Solana Foundation and Solana Identity Group.Read more - Solana Attestation Service is now liveINSTITUTIONSThe Block: Franklin Templeton Extends Franklin Onchain U.S. Government Money Fund to SolanaUsers can access the fund, otherwise known as FOBXX, using Franklin Templeton's BENJI platform.READ - The Block: Franklin Templeton Extends Franklin Onchain U.S. Government Money Fund to SolanaDEVELOPERSElectric Capital: Solana Fastest Growing Ecosystem for New BuildersThe report also states that 81% of all DEX transactions come from the Solana ecosystem.Read - Electric Capital: Solana Fastest Growing Ecosystem for New BuildersPAYMENTSSolana Ecosystem Announces 'Onchain Holiday'Introducing Onchain Holiday: an online Solana-powered shopping event running from that allows users to spend their stablecoins and memecoins on merchandise from over a dozen brands and retailers.Learn more - Solana Ecosystem Announces 'Onchain Holiday'NEWSSolana Accelerate brings together 3000+ founders, devs, and policymakers in NYCWatch any talk you missed on YouTube covering the latest in crypto product and policy in America.Watch - Solana Accelerate brings together 3000+ founders, devs, and policymakers in NYCDEVELOPERSSolana Attestation Service is now liveLearn how to privately verify off-chain data associated with any wallet using the new open source, permissionless protocol to attest to anything in this blog from the Solana Foundation and Solana Identity Group.Read more - Solana Attestation Service is now liveINSTITUTIONSThe Block: Franklin Templeton Extends Franklin Onchain U.S. Government Money Fund to SolanaUsers can access the fund, otherwise known as FOBXX, using Franklin Templeton's BENJI platform.READ - The Block: Franklin Templeton Extends Franklin Onchain U.S. Government Money Fund to SolanaDEVELOPERSElectric Capital: Solana Fastest Growing Ecosystem for New BuildersThe report also states that 81% of all DEX transactions come from the Solana ecosystem.Read - Electric Capital: Solana Fastest Growing Ecosystem for New BuildersPAYMENTSSolana Ecosystem Announces 'Onchain Holiday'Introducing Onchain Holiday: an online Solana-powered shopping event running from that allows users to spend their stablecoins and memecoins on merchandise from over a dozen brands and retailers.Learn more - Solana Ecosystem Announces 'Onchain Holiday'12345Join a community of millions.Fee Paying Accounts, All TimeNFTs MintedMedian Fee per TransactionMade for mass adoption.Live dataFastDon’t keep your users waiting. Solana has block times of 400 milliseconds — and as hardware gets faster, so will the network.Transactions per SecondScalableGet big, quick. Solana is made to handle thousands of transactions per second, and fees for both developers and users remain less than $0.0025.Total TransactionsDecentralizedThe Solana network is validated by thousands of nodes that operate independently of each other, ensuring your data remains secure and censorship resistant.Validator NodesEnergy EfficientSolana’s proof of stake network and other innovations minimize its impact on the environment. Each Solana transaction uses about the same energy as a few Google searches.Net Carbon ImpactEnergy Efficient - Learn moreDesigned for real world use.Go to Case StudiesCase StudyXPXP aims to save consumers from high event ticket fees using Solana. Case StudyXPXP aims to save consumers from high event ticket fees using Solana. case StudyBoba GuysBoba Guys used a Solana-powered loyalty program to increase monthly sales by 67%. Case StudyHomebaseHomebase used the Solana blockchain to successfully tokenized a single-family rental property. VideoHivemapperHivemapper decentralizes mapping with better real-time data and community incentivesBuild for growth.PaymentsGamingNFTsDeFiDAOsPaymentsGamingNFTsDeFiDAOsSolana Pay is now available to millions of businesses as an approved app integration on Shopify. Solana Pay is built for immediate USDC transactions, fees that are fractions of a penny, and a net-zero environmental impact.Learn more about Payments on SolanaJoin a thriving community.It's time to join the thousands of creators, artists, and developers using Solana.Start BuildingManaged by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 5498,
      "headings": [
        {
          "level": 1,
          "text": "Powerful for developers. Fast for everyone."
        },
        {
          "level": 2,
          "text": "Solana Ecosystem Announces 'Onchain Holiday'"
        },
        {
          "level": 2,
          "text": "Solana Accelerate brings together 3000+ founders, devs, and policymakers in NYC"
        },
        {
          "level": 2,
          "text": "Solana Attestation Service is now live"
        },
        {
          "level": 2,
          "text": "The Block: Franklin Templeton Extends Franklin Onchain U.S. Government Money Fund to Solana"
        },
        {
          "level": 2,
          "text": "Electric Capital: Solana Fastest Growing Ecosystem for New Builders"
        },
        {
          "level": 2,
          "text": "Solana Ecosystem Announces 'Onchain Holiday'"
        },
        {
          "level": 2,
          "text": "Solana Accelerate brings together 3000+ founders, devs, and policymakers in NYC"
        },
        {
          "level": 2,
          "text": "Solana Attestation Service is now live"
        },
        {
          "level": 2,
          "text": "The Block: Franklin Templeton Extends Franklin Onchain U.S. Government Money Fund to Solana"
        },
        {
          "level": 2,
          "text": "Electric Capital: Solana Fastest Growing Ecosystem for New Builders"
        },
        {
          "level": 2,
          "text": "Solana Ecosystem Announces 'Onchain Holiday'"
        },
        {
          "level": 2,
          "text": "Join a community of millions."
        },
        {
          "level": 2,
          "text": "Made for mass adoption."
        },
        {
          "level": 2,
          "text": "Build for growth."
        },
        {
          "level": 2,
          "text": "Join a thriving community."
        },
        {
          "level": 2,
          "text": "It's time to join the thousands of creators, artists, and developers using Solana."
        },
        {
          "level": 3,
          "text": ""
        },
        {
          "level": 3,
          "text": ""
        },
        {
          "level": 3,
          "text": ""
        },
        {
          "level": 3,
          "text": "Fast"
        },
        {
          "level": 3,
          "text": "Scalable"
        },
        {
          "level": 3,
          "text": "Decentralized"
        },
        {
          "level": 3,
          "text": "Energy Efficient"
        },
        {
          "level": 3,
          "text": "XP"
        },
        {
          "level": 3,
          "text": "XP"
        },
        {
          "level": 3,
          "text": "Boba Guys"
        },
        {
          "level": 3,
          "text": "Homebase"
        },
        {
          "level": 3,
          "text": "Hivemapper"
        },
        {
          "level": 4,
          "text": "Designed for real world use."
        }
      ],
      "scraped_at": "2025-07-12 22:05:12"
    },
    "https://solana.com/learn": {
      "url": "https://solana.com/learn",
      "title": "Solana",
      "description": "Fast. Decentralized. Scalable. Energy efficient. Solana can power thousands of transactions per second.",
      "content": "SolanaLearnDevelopersSolutionsNetworkCommunitySearchLearn about SolanaMaster the essentials of Solana with these no code learning resources for builders, investors, and enthusiasts.Start LearningDeveloper DocsPart 1An introduction to Solana - a fast, low-cost network that enables new ways to transfer value, create applications, and interact online.Read morePart 2Learn what a Solana wallet is, how it works, and how to set one up safely. Your wallet is the tool you'll use to interact with Solana applications.Read morePart 3Learn how transaction fees work on Solana, why they're low, and what this means for different use cases.Read morePart 4Learn how to send and receive SOL tokens - the fundamental skill for interacting with the Solana network and its applications.Read morePart 5Learn how staking works on Solana, how to earn rewards by helping secure the network, and what to consider when choosing validators.Read morePart 6Learn about tokens - the different types of digital assets on Solana including stablecoins, wrapped tokens, and project tokens.Read morePart 7Learn about Non-Fungible Tokens (NFTs) on Solana - unique digital assets that represent ownership of specific items like art, collectibles, and more.Read morePart 8Learn about decentralized finance (DeFi) applications on Solana, including trading, lending, and yield opportunities.Read morePart 9Discover the diverse ecosystem of applications built on Solana - from financial services and gaming to social platforms and creative tools, all accessible with just your wallet.Read morePart 10Learn essential security practices to protect your assets and avoid common scams while using Solana applications.Read moreContinue Your JourneyReady to dive deeper? Explore these essential resources for Solana developersDocumentationView allOfficial Solana documentation and API referencesCookbookView allCode snippets and recipes for common tasksCoursesView allStructured learning paths for Solana developmentWalletsView allExplore Solana wallets to manage your assetsManaged by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 2229,
      "headings": [
        {
          "level": 1,
          "text": "Learn about Solana"
        },
        {
          "level": 2,
          "text": "Continue Your Journey"
        },
        {
          "level": 3,
          "text": "Documentation"
        },
        {
          "level": 3,
          "text": "Cookbook"
        },
        {
          "level": 3,
          "text": "Courses"
        },
        {
          "level": 3,
          "text": "Wallets"
        }
      ],
      "scraped_at": "2025-07-12 22:05:14"
    },
    "https://solana.com/docs/intro/quick-start": {
      "url": "https://solana.com/docs/intro/quick-start",
      "title": "Solana Quick Start Guide | Solana",
      "description": "Learn Solana development basics. Create your first program, understand accounts, send transactions, and explore PDAs and CPIs using Solana Playground - no installation required.",
      "content": "Solana Quick Start Guide | SolanaLearnDevelopersSolutionsNetworkCommunitySearchDocumentationAPICookbookGet SupportGetting StartedQuick StartInstallationCore ConceptsSolana Account ModelTransactions and InstructionsTransaction FeesPrograms on SolanaProgram Derived AddressCross Program InvocationTokens on SolanaBasicsExtensionsDeveloping ProgramsSolana SDKsReferencesTable of ContentsSolana DocumentationSolana Quick Start GuideWelcome to the Solana Quick Start Guide. This hands-on guide introduces you to the core concepts for building on Solana, regardless of your prior experience. What You'll Learn In this tutorial, you'll learn about: Solana Accounts: Learn how the Solana network stores data. Sending Transactions: Learn to interact with the Solana network by sending transactions. Building and Deploying Programs: Create your first Solana program and deploy it to the network. Program Derived Addresses (PDAs): Learn how to use PDAs to create deterministic addresses for accounts. Cross-Program Invocations (CPIs): Learn how to call other programs from within your program, enabling complex interactions and composability between different programs on Solana. The best part? You don't need to install anything. This guide uses Solana Playground, a browser-based development environment. Follow along, copy, and paste code, and see results immediately, all from your web browser. Basic programming knowledge helps but isn't required. Time to dive in and start building on Solana. Solana Playground Solana Playground (Solpg) provides a browser-based development environment that allows you to quickly develop, deploy, and test Solana programs. Open a new tab in your web browser and navigate to https://beta.solpg.io/. Create Playground WalletNew Solana Playground users should first create a Playground Wallet. This wallet enables you to interact with the Solana network right from your browser.Step 1. Connect to PlaygroundClick the \"Not connected\" button at the bottom left of the screen.Not ConnectedStep 2. Create Your WalletThe system prompts you to save your wallet's keypair. Once ready, click \"Continue\" to proceed.Create Playground WalletYou should now see your wallet's address, SOL balance, and connected cluster (devnet by default) at the bottom of the window.ConnectedYour browser's local storage saves your Playground Wallet. Clearing your browser cache removes your saved wallet. Use your Playground Wallet only for testing and development. Don't send real assets (from mainnet) to this address.Some definitions you may find helpful: wallet address: a 32-byte public key from a Ed25519 keypair, generally displayed as a base-58 encoded string (e.g., 7MNj7pL1y7XpPnN7ZeuaE4ctwg3WeufbX5o85sA91J1). The corresponding private key signs transactions from this address. On Solana, an address serves as the unique identifier for a user's wallet, a program (smart contract), or any other account on the network. connected cluster: the Solana network for your current interactions. Common clusters include: devnet: A development network for developer experimentation testnet: A network reserved for validator testing (don't use as app developer) mainnet-beta: The main Solana network for live transactions Get Devnet SOLBefore starting development, you need to get some devnet SOL.As a developer, you need SOL for two main use cases: Creating new accounts to store data or deploy programs on the network Paying transaction fees when interacting with the Solana network Two methods to fund your wallet with devnet SOL:Option 1: Using the Playground TerminalTo fund your Playground wallet with devnet SOL. In the Playground terminal, run:Terminal$ solana airdrop 5CopyOption 2: Using the Devnet FaucetIf the airdrop command doesn't work (due to rate limits or errors), you can use the Web Faucet. Enter your wallet address (found at the bottom of the Playground screen) and select an amount Click \"Confirm Airdrop\" to receive your devnet SOL Faucet AirdropIs this page helpful?NextReading from NetworkTable of ContentsWhat You'll LearnSolana PlaygroundCreate Playground WalletStep 1. Connect to PlaygroundStep 2. Create Your WalletGet Devnet SOLOption 1: Using the Playground TerminalOption 2: Using the Devnet FaucetEdit PageManaged by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 4433,
      "headings": [
        {
          "level": 1,
          "text": "Solana Quick Start Guide"
        },
        {
          "level": 2,
          "text": "What You'll Learn"
        },
        {
          "level": 2,
          "text": "Solana Playground"
        },
        {
          "level": 3,
          "text": "Create Playground Wallet"
        },
        {
          "level": 3,
          "text": "Get Devnet SOL"
        },
        {
          "level": 3,
          "text": "Table of Contents"
        },
        {
          "level": 4,
          "text": "Step 1. Connect to Playground"
        },
        {
          "level": 4,
          "text": "Step 2. Create Your Wallet"
        },
        {
          "level": 4,
          "text": "Option 1: Using the Playground Terminal"
        },
        {
          "level": 4,
          "text": "Option 2: Using the Devnet Faucet"
        }
      ],
      "scraped_at": "2025-07-12 22:05:14"
    },
    "https://solana.com/developers": {
      "url": "https://solana.com/developers",
      "title": "Developers: Resources and Information for Building on Solana | Solana",
      "description": "Learn why Solana is used by the best and brightest teams in crypto. Explore our guides and examples to start building on the Solana blockchain.",
      "content": "Developers: Resources and Information for Building on Solana | SolanaLearnDevelopersSolutionsNetworkCommunitySearchDocumentationAPICookbookGet SupportDeveloper ResourcesA manual for joining the Solana ecosystem. By builders for builders.Build NowGet SupportLearn Solana developmentUse these Solana Foundation and community courses to begin your journey into Solana development.By UnboxedSolana Development CoursesBy Solana FoundationSolana BootcampBy Solana FoundationSolana BytesBy RiseIn.comBuild on Solana by Rise InBy RareSkills.ioEthereum to Solana Developer CourseBy HackquestSolana Learning TrackBy CareerBooster.ioRust + Solana Advance Development CourseBy UnboxedSolana Development CoursesQuickstart your Solana development starting from nothing to complex programs.By Solana FoundationSolana BootcampBy Solana FoundationSolana BytesBy RiseIn.comBuild on Solana by Rise InBy RareSkills.ioEthereum to Solana Developer CourseBy HackquestSolana Learning TrackBy CareerBooster.ioRust + Solana Advance Development CourseTutorials and guides.Learn from tutorials and guides from across the greater Solana ecosystem.View allintermediateMinimizing the amount of compute a program uses is critical both for the performance and cost of executing transactions. This guide will show you how to optimize compute usage in your programs on Solana.Learn moreintroA list of the most common ways to get devnet and testnet SOL tokens for Solana development. Including: airdrop, web3.js, POW faucet, and more.Learn morebeginnerWith the new token extensions, you can create custom logic for your tokens. In this guide we will go over everything you need to know about token extensions and what you need to get started building todayLearn moreintermediateMinimizing the amount of compute a program uses is critical both for the performance and cost of executing transactions. This guide will show you how to optimize compute usage in your programs on Solana.Learn moreintroA list of the most common ways to get devnet and testnet SOL tokens for Solana development. Including: airdrop, web3.js, POW faucet, and more.Learn morebeginnerWith the new token extensions, you can create custom logic for your tokens. In this guide we will go over everything you need to know about token extensions and what you need to get started building todayLearn moreGo to the source.Read the documentation for Solana and popular tools.Solana DocsView allLearn how Solana works and get a high-level understanding of Solana's architecture.Anchor DocsView allQuickly build secure Solana programs in Rust using the Anchor framework.Solana ChangelogAgave 2.0 reaches supermajority on mainnet; 2.1 coming. Updates include Windows build fixes & QUIC voting implementation. New resources cover web3.js v2 and ...Latest episodeSolana Developer UpdateSign up to the newsletter and learn about new resources, new commits, new proposals, and more.Sign upEven more resourcesMore videos, more episodes. Discussions between industry leaders in both blockchain and technology, our team, and community developers.YouTubePodcastManaged by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 3273,
      "headings": [
        {
          "level": 1,
          "text": "Developer Resources"
        },
        {
          "level": 2,
          "text": "Learn Solana development"
        },
        {
          "level": 2,
          "text": "Tutorials and guides."
        },
        {
          "level": 2,
          "text": "Go to the source."
        },
        {
          "level": 3,
          "text": "Solana Development Courses"
        },
        {
          "level": 3,
          "text": "Solana Bootcamp"
        },
        {
          "level": 3,
          "text": "Solana Bytes"
        },
        {
          "level": 3,
          "text": "Build on Solana by Rise In"
        },
        {
          "level": 3,
          "text": "Ethereum to Solana Developer Course"
        },
        {
          "level": 3,
          "text": "Solana Learning Track"
        },
        {
          "level": 3,
          "text": "Rust + Solana Advance Development Course"
        },
        {
          "level": 3,
          "text": "Solana Development Courses"
        },
        {
          "level": 3,
          "text": "Solana Bootcamp"
        },
        {
          "level": 3,
          "text": "Solana Bytes"
        },
        {
          "level": 3,
          "text": "Build on Solana by Rise In"
        },
        {
          "level": 3,
          "text": "Ethereum to Solana Developer Course"
        },
        {
          "level": 3,
          "text": "Solana Learning Track"
        },
        {
          "level": 3,
          "text": "Rust + Solana Advance Development Course"
        },
        {
          "level": 3,
          "text": "Solana Docs"
        },
        {
          "level": 3,
          "text": "Anchor Docs"
        },
        {
          "level": 3,
          "text": "Solana Changelog"
        },
        {
          "level": 3,
          "text": "Solana Developer Update"
        },
        {
          "level": 3,
          "text": "Even more resources"
        }
      ],
      "scraped_at": "2025-07-12 22:05:16"
    },
    "https://solana.com/environment": {
      "url": "https://solana.com/environment",
      "title": "Solana Climate Dashboard",
      "description": "Explore the Sustainability of the Solana Network",
      "content": "Solana Climate DashboardPlease enable enable JavaScript in your browser settings to run the Solana Climate Dashboard.",
      "content_length": 117,
      "headings": [],
      "scraped_at": "2025-07-12 22:05:17"
    },
    "https://solana.com/news/tag/case-studies": {
      "url": "https://solana.com/news/tag/case-studies",
      "title": "Case Studies - Solana | News",
      "description": "Fast. Decentralized. Scalable. Energy efficient. Solana can power thousands of transactions per second.",
      "content": "Case Studies - Solana | NewsLearnDevelopersSolutionsNetworkCommunitySearchCase StudiesCase Study: Etherfuse Introduces a Mexican ‘Stablebond’ on Solana Etherfuse's financial product could create more inclusive, democratized financial systems. Case Study: TipLink Makes Payments as Easy as Sending a LinkTipLink makes it possible to send money with interactive links, a step change in the accessibility and affordability of payments. Case Study: How Photo Finish LIVE Use Solana for an Onchain Kentucky Derby ExperienceThe game uses Solana to power real-life virtual racing and user ecosystem. Case Study: Helio’s Shopify x Solana Pay Plugin Powers Phone SalesSolana Mobile’s Chapter 2 used the plugin to save over $1,000,000 in fees over traditional payments methods. Case Study: Homebase is Changing Real Estate Investments with SolanaParticipants invested an average of $4,000-$5,000, a much smaller check size than the traditional real estate investor. Case Study: How Boba Guys Revamped Its Rewards Program With SolanaPassport, a loyalty program built on the Solana network from Boba Guys, saw an 800% return on investment. Case Study: XP’s Ticket Marketplace Could Upend the Entertainment IndustryXP tackles the \"Ticketmaster problem\" by using Solana. Case Study: 'Where There's Smoke' Pioneers Onchain Storytelling'Where There's Smoke' mixes storytelling, the internet of things, and Solana NFTs to create an immersive art experience. Case Study: How Pyth is Catalyzing a New Era of Permissioned EnvironmentsPyth uses a Solana Permissioned Environments to enable rapid data processing. Case Study: GainForest brings transparency to climate preservation efforts using blockchain technologyGainForest’s Solana-powered “NFTrees” helps donors track the health of the forests they are supporting. Case Study: Helium brings real-world 5G networks on SolanaHelium, a decentralized physical infrastructure network, migrated to Solana to take advantage of high throughput and low costs. Case Study: Hivemapper decentralizes mapping with better real-time data and community incentivesHivemapper takes advantage of Solana’s scalability to create a community-powered, incentive-driven map. Case Study: Dialect onboards the masses through decentralized social messaging and NFT stickersDialect uses compressed NFTs to onboard thousands of users for free. Case Study: Crossmint scales NFT minting to unlock new use casesCrossmint, an NFT tooling and API company, is using state compression to drop NFTs at a massive scale. Case Study: ASICS builds loyalty program with Solana PayShoe brand ASICS used Solana Pay to created a decentralized loyalty program. Case Study: Change and charitable donations on chainChange provides APIs and no-code applications to empower nonprofits to take advantage of web3. Case Study: Credix and creditCredix is using decentralized finance to expand access to credit in Brazil. Autonomous creates smart contract payment stack with Solana PayA case study with Solana Pay. Managed by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 3188,
      "headings": [
        {
          "level": 1,
          "text": "Case Studies"
        },
        {
          "level": 2,
          "text": "Case Study: Etherfuse Introduces a Mexican ‘Stablebond’ on Solana"
        },
        {
          "level": 2,
          "text": "Case Study: TipLink Makes Payments as Easy as Sending a Link"
        },
        {
          "level": 2,
          "text": "Case Study: How Photo Finish LIVE Use Solana for an Onchain Kentucky Derby Experience"
        },
        {
          "level": 2,
          "text": "Case Study: Helio’s Shopify x Solana Pay Plugin Powers Phone Sales"
        },
        {
          "level": 2,
          "text": "Case Study: Homebase is Changing Real Estate Investments with Solana"
        },
        {
          "level": 2,
          "text": "Case Study: How Boba Guys Revamped Its Rewards Program With Solana"
        },
        {
          "level": 2,
          "text": "Case Study: XP’s Ticket Marketplace Could Upend the Entertainment Industry"
        },
        {
          "level": 2,
          "text": "Case Study: 'Where There's Smoke' Pioneers Onchain Storytelling"
        },
        {
          "level": 2,
          "text": "Case Study: How Pyth is Catalyzing a New Era of Permissioned Environments"
        },
        {
          "level": 2,
          "text": "Case Study: GainForest brings transparency to climate preservation efforts using blockchain technology"
        },
        {
          "level": 2,
          "text": "Case Study: Helium brings real-world 5G networks on Solana"
        },
        {
          "level": 2,
          "text": "Case Study: Hivemapper decentralizes mapping with better real-time data and community incentives"
        },
        {
          "level": 2,
          "text": "Case Study: Dialect onboards the masses through decentralized social messaging and NFT stickers"
        },
        {
          "level": 2,
          "text": "Case Study: Crossmint scales NFT minting to unlock new use cases"
        },
        {
          "level": 2,
          "text": "Case Study: ASICS builds loyalty program with Solana Pay"
        },
        {
          "level": 2,
          "text": "Case Study: Change and charitable donations on chain"
        },
        {
          "level": 2,
          "text": "Case Study: Credix and credit"
        },
        {
          "level": 2,
          "text": "Autonomous creates smart contract payment stack with Solana Pay"
        }
      ],
      "scraped_at": "2025-07-12 22:05:18"
    },
    "https://solana.com/news/case-study-xp": {
      "url": "https://solana.com/news/case-study-xp",
      "title": "Case Study: XP Tackles 'the Ticketmaster Problem' | Solana",
      "description": "XP, an independent blockchain ticketing platform, uses the Tamperproof protocol to offer a more transparent way to buy and sell live event tickets.",
      "content": "Case Study: XP Tackles 'the Ticketmaster Problem' | SolanaLearnDevelopersSolutionsNetworkCommunitySearchHome>NewsCase Study: XP’s Ticket Marketplace Could Upend the Entertainment Industryby Solana FoundationHighlightsXP is a blockchain-based ticket marketplace offering secure and transparent ticket transactions using XP’s proprietary Tamperproof protocol.It enables the encryption of ticket codes as NFTs, allowing seamless ticket trading on its platform.XP’s marketplace hosts 34 million tickets from more than 110,000 live events in the United States and Canada, including concerts, sports, comedy, and more. Solana's significantly lower fees make it financially viable to eliminate the dreaded 'junk fees' that have long plagued ticket buyers.Instantaneous, real-time settlements on Solana help XP foster a more direct connection between buyers and sellers.Solana’s speed and high throughput is essential for building a scalable ticketing platform with the potential to service millions of high user traffic. The ticket industry is broken, and its number-one issue can be summed up as the “Ticketmaster problem.” It sounds familiar: A musical artist comes to town, and you decide to buy tickets online. The venue advertises the price of admission as $55, but upon adding the ticket to your online shopping card and clicking “buy now,” at least three unique types of fees pop up — service fees, processing fees and delivery fees — bringing the final price to $80, a 37% markup from face value.Then there’s the lack of transparency. You don’t know who gets a cut of these fees, whether Ticketmaster or its now-parent company, Live Nation. But you do know one thing: Artists and performers won’t receive a portion of those extra fees, even though they frequently pay Ticketmaster-affiliated vendors a slice of their merch sales and split revenue from ticket sales. In fact, the issue is so problematic that the U.S. Senate held a hearing in January 2023 to question why some 70% of tickets are sold through a single vendor.XP solves the ‘Ticketmaster problem’ using SolanaThe so-called “Ticketmaster problem” could be solved through decentralized technology. XP, an independent blockchain ticketing platform, uses the Tamperproof protocol to offer a more transparent, efficient, and cost-effective way to buy and sell tickets. Behind the scenes, XP's transactions use Solana's blockchain, denominated in USDC, to help buyers easily make the switch and rival the user experience (UX) of incumbent vendors — just without the junk fees. XP encrypts ticket codes as nonfungible tokens (NFTs), allowing for the seamless exchange between buyers and sellers, who can see when a ticket is redeemed.The Tamperproof protocol has the ability to encrypt or “seal” ticket claim codes within a special type of NFT known as “Tamperproof NFTs” (tpNFTs). This ensures they remain inaccessible until the holder decides to break the seal. This unique sealing feature addresses the need for security and authenticity, both major concerns when selling any kind of real-world asset on a secondary marketplace. Transactions are secure, transparent and verifiable, thanks to the public visibility of the blockchain and instantaneous updates of a tpNFT’s sealed or unsealed status on the Solana public ledger.At the time of publication, XP has an inventory of roughly 34 million tickets, spanning over 110,000 events — a wide selection for prospective attendees. Sealed vs. UnsealedEnsuring authenticityTickets on XP are more than just digital passes; they are Tamperproof NFTs. This innovative approach to ticket encryption means buyers and sellers can confidently engage in transactions, knowing that their tickets are secure and their value is preserved.Sealed ticketsThe protocol recognizes that sealed tickets contain an unused code and therefore not redeemed yet. The automation in the protocol makes this secure.Unsealed ticketsOnce unsealed, these tickets are ready to be transferred to the end user. Why Solana? The strategic choiceChoosing Solana for XP was a deliberate decision, says Michael Saunders, CEO of XP. The decision was driven by the need for efficiency and cost-effectiveness.“I found Ethereum back in 2017,” he said, “but using it with anything for anything real with gas fees being as high as it was just seemed unscalable.” While searching for the blockchain for his company to build the protocol, it became clear that Solana’s low transaction fees and high-throughput capabilities provided a major competitive advantage.XP leverages Solana’s blockchain technology in a few different ways.Tokenized tickets: The protocol encrypts and seals secret ticket codes in the form of “Tamperproof nonfungible tokens” (tpNFTs), ensuring their integrity and redeemability.Composable oracle services: Any company or independent ticket vendor can use the platform to sell tickets at market value, with real-world data encoding the price of the ticket into its NFT. Cost effectiveness: Solana enables XP to offer cheaper ticketing and user-friendly payment methods (credit card, USDC). Transparency: XP's tpNFTs maintain their sealed or unsealed status publicly, visible in the NFT metadata on the Solana public ledger. This transparency ensures that sealed tpNFTs contain an unused code.Transaction volume and community-building at scale: While cost savings is one of the primary benefits of using the Solana network, its high-throughput design makes it possible for artists, entertainers and vendors to form communities for their ticket buyers. Saunders believes this feature will lend itself to VIP experiences, fan clubs and more.Security with Tamperproof Protocol: Authenticity is coded into the ticket, critical for establishing user verifiability.Industry disruption: XP challenges the high fees and lack of transparency in the traditional ticketing industry.The benefit to customers For now, says Saunders, the benefit to customers is cost savings. “We are 20% to 30% cheaper than StubHub, Vivid or Seat Geek, and we are safer than Reddit or Facebook Marketplace,” he said. But that’s just the beginning, he expects. “We are built on top of Solana, and because of that there are different types of experiences beyond just a ticket,” he explained, highlighting the infinite potential when speed, scalability and cost are not adding friction.XP's platform is also designed with user experience in mind, offering a familiar and comfortable interface for purchasing tickets. Users can sign up with a phone number and purchase tickets with a credit card, without needing to understand or interact with cryptocurrency directly — making it accessible to audiences outside of web3.The platform aims to be a discovery tool for events as well as a secondary marketplace, providing users with access to a wide range of tickets at competitive prices. Saunders envisions XP as a community where users can access wholesale prices on tickets, benefiting from being part of the XP user base.Overall, XP represents an innovative approach to ticketing, combining traditional marketplace features with the benefits of blockchain technology to offer a more user-friendly, secure, and cost-effective ticket buying experience. Join the new art world.Hear about the latest news, tools, and events for creatives using Solana.Sign UpManaged by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 7500,
      "headings": [
        {
          "level": 1,
          "text": "Case Study: XP’s Ticket Marketplace Could Upend the Entertainment Industry"
        },
        {
          "level": 2,
          "text": "XP solves the ‘Ticketmaster problem’ using Solana"
        },
        {
          "level": 2,
          "text": "Why Solana? The strategic choice"
        },
        {
          "level": 2,
          "text": "The benefit to customers"
        },
        {
          "level": 2,
          "text": "Join the new art world."
        },
        {
          "level": 3,
          "text": "Sealed tickets"
        },
        {
          "level": 3,
          "text": "Unsealed tickets"
        },
        {
          "level": 4,
          "text": "Ensuring authenticity"
        }
      ],
      "scraped_at": "2025-07-12 22:05:19"
    },
    "https://solana.com/news/case-study-boba-guys": {
      "url": "https://solana.com/news/case-study-boba-guys",
      "title": "Case Study: Boba Guys Build Loyalty with Blockchain | Solana",
      "description": "Passport, a loyalty program built on the Solana network from Boba Guys, saw an 800% return on investment.",
      "content": "Case Study: Boba Guys Build Loyalty with Blockchain | SolanaLearnDevelopersSolutionsNetworkCommunitySearchHome>NewsCase Study: How Boba Guys Revamped Its Rewards Program With Solanaby Solana FoundationHighlightsIn 2023, tea retailer Boba Guys developed \"Passport,\" a blockchain-based loyalty program that goes beyond traditional models, featuring gamification, exclusive rewards and digital collectibles.The Passport program relies on Solana’s fast transaction-processing capabilities, which enable it to manage high-volume, small-scale transactions in retail settings.The Passport program saw 15,000 users join in its first 80 days, with at least one Boba Guys location now reporting as many as 70% of orders made through the program since its launch.A pilot of the program was a success for Boba Guys — a 67% increase in monthly visits, a 65% increase in monthly spending, and an 800% return on investment.When you think of retail rewards programs, you might envision stale punch cards or confusing airline points lacking in real incentives. However, the innovative approach taken by Boba Guys with the Solana blockchain paints a different picture of what’s possible.Founded 12 years ago, Boba Guys is a primarily brick-and-mortar business with 20 locations across the Bay Area, Los Angeles and New York. The company is known for its innovation and customer-focused approach in the industry — so when it was time for the company to launch a loyalty program in 2023, founders Bin Chen and Andrew Chau wanted to transcend the conventional models they were tired of seeing. \"We always felt like the traditional loyalty programs out there were just basically glorified digital punch cards,” said Chen. By building on Solana, the Boba Guys Passport program can do a lot more. The program rewards participating customers in interactive ways, earning them points for every visit, along with gamified features like loot boxes and loyalty tiers that unlock secret menu items — all improved by using blockchain technology.Improving the retail rewards experience with SolanaWhile traditional loyalty programs unlock rewards for frequent customers, doing so on the blockchain gives users an advantage. Rewards that a customer earns are first and foremost owned by the customer themselves — no need to worry about lost physical cards or an app shutting down. This also means that users can do what they want with their rewards — they can redeem them, hold onto them, or even sell them on the open market.Building on the blockchain could also unlock interoperability, or the ability for users to interact with other programs using the same chain without any friction — eventually opening up new benefits for Boba Guys customers beyond a free drink. But while interoperability as a concept exists across blockchain networks, Solana has an advantage in that it operates in a single, global state — not as separate layers or networks. That means that any loyalty program built on Solana has a much broader ecosystem to interact with, from NFT projects to real world infrastructure and more. The opportunities are endless. Drinks from Boba Guys at an event during NFT NYC, 2023. Photo courtesy of the Solana Foundation. “What’s particularly powerful is Solana’s interoperability and composability. Systems can talk and settle seamlessly, enabling collaboration and sharing benefits across various platforms,\" said Chen. “To me, the hallmark of any good ecosystem is not just excitement but actual building and shipping.”That, alongside the Solana network’s ability to quickly and reliably process transactions and low transaction fees make it a viable choice for the numerous small-scale transactions typical in a cafe setting. \"The transaction fees with Solana are just a fraction of a fraction,” said Chen. “This is crucial, especially when you consider our level of activity. Solana stands out because other ecosystems were just too expensive for real-time, high-frequency business use cases like ours. We needed something with low latency that is cost-effective, and that's where Solana excelled.”Integrating blockchain with point-of-sale retail technologyTo make Passport a success, Chen and Chau knew the team’s choice of blockchain would have to seamlessly integrate with Boba Guys' existing POS system and enhance customer checkout flow. “Because we built a Square integration, we were able to onboard customers right at the register,” Chen said in a recent interview with the Solana Foundation. Rather than asking users to navigate an unwieldy, modern web3 onboarding process, customers can join the program with a simple QR code scan during their transaction. Surprisingly, Chen reports this approach appeals to customers of all ages and is not exclusive to digitally native Gen Z shoppers. \"The most eye-opening thing for us has been successfully attracting guests of all ages,” he said. “It's one thing to engage with Gen Z, who intuitively understand technology, but we're a cafe serving a diverse clientele. Some are tech-savvy, others are not. The real test was introducing blockchain technology in a way that's almost invisible to our customers.” A customer using a QR code to purchase drinks from Boba Guys at an NFT NYC event, 2023. Photo courtesy of the Solana Foundation. The rewards are immediate upon signing up, Chen notes: \"Customers can sign up very, very quickly and verify with their phone. Immediately they get a welcome reward.”Passport can be added to a person’s Apple Wallet, making it effortless to both pay and accrue rewards with a smartphone through tap-to-pay. \"We basically live on a lot of people's Apple Wallets,\" Chen states, emphasizing the strategic placement. Rapid adoption and an increase in user engagementThe Passport program saw rapid adoption with significant user engagement, with 15,000 new users onboarded in the first 80 days. The first 10,000 Passport users received a digital collectible as a thank-you, with more benefits to follow in future collaborations. As a brick-and-mortar store, Chen says it can be challenging for Boba Guys to reach guests tangibly, but with the Passport program, the team has a method to deliver items and incentives directly to their customers on demand. And it seems to be working: At Boba Guys’ most popular location in Oakland, CA, Chen notes that 70% of orders were made through the Passport program in 2023. The added user engagement also led to higher sales, with Boba Guys seeing significant increases in purchases per month, higher average order values and monthly spends among loyalty program members, as seen in the results of a 2023 pilot program.Boba Guys 'Passport' Pilot Program ResultsAs of Nov. 1, 2023:67%Increase in monthly visits, per customer65%Increase in monthly spending, per customer800%ROILooking ahead, there seems to be an even greater appetite among customers to advance in loyalty tiers, Chen says, with many customers aiming for the highest reward level.\"The excitement in our program really peaks with the Boba Connoisseur level,” he said. “To qualify, customers need to spend about $400 at Boba Guys annually.”According to Chen, there’s already a “double-digit” number of customers who have reached this coveted status. “For them, we offer secret menus, exclusive merch and air-dropped digital collectibles,” he said.This immensely powerful approach is what Chen considers to be a key factor in mainstreaming web3 and blockchain technology.Looking towards the future of retail with blockchainSo what are the implications for brick-and-mortar retail establishments across the nation? Chen sees them leveraging the blockchain for even more decentralized infrastructure solutions in the future. Chen views the Passport program as both a loyalty program and a stepping stone towards normalizing blockchain technology as a standard item in the retail owner’s toolkit. He also mentions the potential future benefits of blockchain technology, like decentralization, which could offer solutions to common retail problems, such as POS system downtimes.“I think there's something to be said about this idea of decentralization,” he said, alluding to the imperfect nature of centralized financial service providers. “We've had Square go down in the past, and it's extremely disruptive to not be able to take a transaction in our stores and be held kind of hostage to that.”He adds that he doesn’t think web3 payments is “a world that we're going to jump into immediately,” but that it's “prudential” for retail companies to “at least know what's out there.”“Own your own destiny and protect yourself,” he advises.For businesses considering a blockchain rewards program, Chen recommends giving Solana a hard look due to its speed, composability and active ecosystem. He emphasizes the importance of shipping real, usable products rather than getting caught in hype cycles.“Solana's ecosystem is deep and broad, with new products and projects launching almost every week that are genuinely useful in real-world settings,” said Chen. “This constant development is what makes Solana stand out.”Frictionless — and permissionless.Take advantage of the suite of Solana tooling to build better payments rails.Learn moreManaged by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 9395,
      "headings": [
        {
          "level": 1,
          "text": "Case Study: How Boba Guys Revamped Its Rewards Program With Solana"
        },
        {
          "level": 2,
          "text": "Improving the retail rewards experience with Solana"
        },
        {
          "level": 2,
          "text": "Integrating blockchain with point-of-sale retail technology"
        },
        {
          "level": 2,
          "text": "Rapid adoption and an increase in user engagement"
        },
        {
          "level": 2,
          "text": "Boba Guys 'Passport' Pilot Program Results"
        },
        {
          "level": 2,
          "text": "Looking towards the future of retail with blockchain"
        },
        {
          "level": 2,
          "text": "Frictionless — and permissionless."
        },
        {
          "level": 3,
          "text": "67%"
        },
        {
          "level": 3,
          "text": "65%"
        },
        {
          "level": 3,
          "text": "800%"
        }
      ],
      "scraped_at": "2025-07-12 22:05:21"
    },
    "https://solana.com/news/case-study-homebase": {
      "url": "https://solana.com/news/case-study-homebase",
      "title": "Case Study: Homebase and Real Estate Investments on Solana | Solana",
      "description": "Homebase used Solana to tokenize real estate assets.",
      "content": "Case Study: Homebase and Real Estate Investments on Solana | SolanaLearnDevelopersSolutionsNetworkCommunitySearchHome>NewsCase Study: Homebase is Changing Real Estate Investments with Solanaby Solana FoundationHighlightsHomebase, leveraging the Solana blockchain, successfully tokenized a $235,000 single-family rental property in South Texas in March 2023.The platform raised $246,800 in just two weeks from 38 investors through the sale of NFTs tied to the physical real estate asset.The Homebase model is meant to broaden participation in real estate investments. Of Homebase’s 76 total investors between both homes, roughly 78% are non-institutional. There was a minimum $500 threshold to invest and the average check size was between $4,000 and $5,000.Concerns over fees and technical limitations steered Homebase to building on Solana. Solana’s user-friendly USDC payments through Circle support allowed seamless property tokenization, crucial for investor confidence and accessibility.Homebase is now focusing on bringing its learnings to the commercial real estate market.Homebase, a pioneering startup in real estate tokenization, made a significant breakthrough when it sold a single-family home in McAllen, Texas to 38 investors — 30 of them non-institutional. Unlike traditional real estate investing, which is focused on commercial or multi-family buildings, Homebase tokenized a single family building. The property was valued at $235,000. Homebase raised $246,800 in capital in two weeks, putting aside the extra $11,800 of the total raised for potential maintenance, like any good real estate investor. The deal, a collective agreement between strangers (some of whom hadn't previously been excited about crypto before — or had even opened a crypto wallet), speaks volumes about the market's confidence in this model. Yet innovation isn’t the company’s only motivation; it’s also motivated by financial accessibility and inclusion. The first house, in McAllen Texas. Courtesy Homebase.\"Real estate is an important to financial freedom,” says Homebase co-founder and CEO Domingo Valadez. “The gap now between median income and median home price is the highest it's ever been. What can we do to make real-estate investing more attainable for people?\"Three months after its first sale, the company pulled off another successful sale of a similarly priced home in the same area. The second time, another 38 investors shared ownership of a $176,100 home, with an average check size of $4,638.The intricacies of the Homebase processHomebase's journey to this achievement wasn’t a straightforward path. Valadez revealed in an article in Blockworks that the team spent seven months solely on legal and compliance preparations.According to Valadez, the team faced a challenging choice between quick execution and thorough groundwork. While they knew the idea would be a slam-dunk, they wanted to make sure it could also stand up legally. The platform opted for a more cautious route, focusing on developing the right regulatory structure. Homebase partnered with the law firm Hunton Andrews Kurth to build a previously non-existent token wrapper that would allow for certain oversight measures. Using the Metaplex protocol, the team created the wrapper to modify non-fungible tokens (NFTs), giving Homebase the ability to step in as a third party and freeze, burn and reissue tokens as needed. The wrapper also enforces KYC requirements and a mechanism to escrow funds upon property purchase, with the release of funds contingent upon reaching the crowdsourced funding goal. Finally, the wrapper also encodes a one-year lockup period that would restrict trading within this initial timeframe, designed for compliance with Regulation D.Choosing the right blockchainThe decision-making process for the blockchain on which to build the Homebase infrastructure was somewhat arduous, says Valadez — particularly because the majority of Homebase’s early investors were not familiar with digital assets.“As you can imagine, we came in with a thesis that crypto-native people really wanted something like Homebase, but we learned that actually this is an everyone problem, not just a crypto problem,” Valadez said. In the March 2023 sale, for instance, 15 of the 38 buyers created their first Solana wallet specifically for the purchase of the Homebase NFT.A fractionalized homeownership solution (and its user experience) therefore has to be as seamless as logging into any familiar website, such as a bank portal. Challenges like gas fee fluctuations and technical challenges in other blockchain ecosystems led Homebase to seek a different option.“Bridging from a Layer 2 blockchain is actually quite complex,” Valadez said. “And there's a period of time in which your money just disappears as it’s transitioning from one blockchain to the other.” Not so great for investor confidence.Solana emerged as the ideal choice due to its user-friendly interface supporting USDC, which ensured a hassle-free property tokenization process. The suite of tools available within the Solana ecosystem have also provided easy-enough solutions that the Homebase team could walk its early investors through the process. “We do all rental distributions in USDC,” Valadez said, adding that the team has partnered with stablecoin issuer Circle to do so. Then there’s the process of on- and off-ramp. To keep the fiat-to-crypto exchange process all inside the Homebase platform, the team integrated with onboarding solution CoinFlow. “We integrated the on-ramps and off-ramps in the same platform,” explained Valadez. “So you as a non-web3 native withdraw your portion of the property’s monthly rent into your bank account when you’re ready.”When owners are ready to sell their portion of the property, they can also do that within the Homebase platform. Here, the use of blockchain technology offers significant advantages. With traditional real estate investments among friends, selling involves complex agreements and permissions. In contrast, Homebase employs tokens representing ownership in the property's holding LLC. This means selling doesn't require approval from other LLC members; it's simply facilitated on the platform. When an owner does want to buy, Homebase matches sellers with interested buyers, streamlining the process with online documentation via DocuSign, reducing the typical hurdles found in private real estate markets.Such ease of use is paramount, says Valadez, who strives to engender confidence in new investors who may not have otherwise considered themselves as players in the real estate game. The second house, in McAllen Texas. Courtesy Homebase.‘An amazing experience’Quietly, at the southern tip of the Rio Grande Valley, Homebase’s venture into tokenized real estate is creating a seismic shift in the industry. Its cautious approach is laying a robust compliance foundation, setting them apart in a market entangled with legal complexities and providing some precedent that we can all learn from.The decision to build on Solana was clear given Homebase prioritizes user-friendliness, scalability and mainstream adoption. User experience is crucial for attracting investors unfamiliar with digital assets — which are the ones Homebase is best positioned to serve with its product. Solana’s stability, interface, and support for USDC made property tokenization hassle-free and helped the company abstract away the friction from investors’ line of sight.“I like building on Solana, even in the toughest of winter or bear markets,” said Valadez. “It gave everyone who stuck around really high conviction in the environment, with the other teams building and in the foundation holistically. To be a part of that has just been an amazing experience.”Building on this foundation, Homebase is now applying its expertise to the commercial sector. The team is now offering back office software for real estate syndicators like EmpireDAO to make commercial real estate investment more accessible. Using blockchain technology and Solana's capabilities, Homebase aims to establish liquidity pools that enable easier trading of real estate assets, potentially transforming how commercial real estate is bought and sold.Homebase’s aim is clear: making commercial real estate accessible and dynamic while instilling confidence in new investors. It’s not just new tech; it's a gateway to financial inclusivity.Built for what's possible.See how teams like Helium, Decaf, and more are taking advantage of the Solana tech stack to build a fast, secure, scalable, and user-friendly future.LEARN MOREManaged by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 8794,
      "headings": [
        {
          "level": 1,
          "text": "Case Study: Homebase is Changing Real Estate Investments with Solana"
        },
        {
          "level": 2,
          "text": "The intricacies of the Homebase process"
        },
        {
          "level": 2,
          "text": "Choosing the right blockchain"
        },
        {
          "level": 2,
          "text": "‘An amazing experience’"
        },
        {
          "level": 2,
          "text": "Built for what's possible."
        }
      ],
      "scraped_at": "2025-07-12 22:05:22"
    },
    "https://solana.com/news/case-study-hivemapper": {
      "url": "https://solana.com/news/case-study-hivemapper",
      "title": "Case Study: Hivemapper decentralizes mapping with better real-time data and community incentives | Solana",
      "description": "Hivemapper takes advantage of Solana’s scalability to create a community-powered, incentive-driven map.",
      "content": "Case Study: Hivemapper decentralizes mapping with better real-time data and community incentives | SolanaLearnDevelopersSolutionsNetworkCommunitySearchHome>NewsCase Study: Hivemapper decentralizes mapping with better real-time data and community incentivesby Solana FoundationHighlights:﻿Hivemapper uses the Solana blockchain to create a community-powered, incentive-driven online map.Hivemapper takes advantage of state compression technology on Solana to bring fees down significantly and maintain the rewards cycle.Decentralized physical infrastructure networks, powered by the blockchain, are finding a home on Solana.Ariel Seidman first fell in love with maps in 2004, when he started work as a Director of Product Management for Yahoo! Maps. “Maps are that rare combination of art and utility,” he wrote in a recent blog post. “They are both incredibly beautiful and useful. Billions of people rely on maps every day of their lives.”“Through the ups and downs, my mission has always been the same: Build the world’s best map,” he wrote. With Hivemapper, he’s using web3 to make it happen. “We’re a team of builders who are focused on utility and actually building something for the real world and for real people. Our mission is to build the world’s freshest decentralized map with transparent and aligned incentives at a fraction of the cost.”Seidman first founded Hivemapper in 2015 with an eye toward using drones to build better maps, then pivoted to using dash cams instead. In November 2022, the company launched the Hivemapper Network: a user-driven global mapping network built on the Solana blockchain. Hivemapper’s users capture street-level imagery with the help of the company’s tailor-made dash cams, receiving HONEY tokens to incentivize data collection as they drive (and soon as they bike). Hivemapper turns that crowdsourced data into a world map — one that’s constantly expanding and updating thanks to the flow of fresh data. Users can also earn tokens for providing quality assurance checks on routes mapped by others. In April, Hivemapper launched a simple game designed to help train map AI to better recognize objects within images, providing another avenue for users to earn tokens. The network has already charted more than 2.4 million miles of unique roads. “In the past, companies like Google have spent up to half a million dollars on dedicated mapping vehicles,” says Hivemapper’s Head of Operations Gabe Nelson. “It’s really expensive, and it’s also very centralized. The places that have good maps are determined by where those companies are willing to invest their resources. Meanwhile, people and businesses are relying on that data to make decisions, even when it’s really out of date.” Hello! Use the editor to add your copy!Hivemapper has tens of thousands — and soon, they hope, millions — of users who simply take images of the world as they drive around. And the recently announced state compression capabilities on Solana are crucial for managing users at that scale, Nelson says.“The inspiration of Hivemapper was to apply the principles of web3 and decentralization to the way that maps are collected,” Nelson says. “There are billions of people who travel throughout the world every day on cars, trucks, bikes, and motorcycles. And all of those people have the potential to collect data on the exact, current condition of all those roads. If a community wants a better map, they can go out and build it.\" “The inspiration of Hivemapper was to apply the principles of web3 and decentralization to the way that maps are collected,” Nelson says. “There are billions of people who travel throughout the world every day on cars, trucks, bikes, and motorcycles. And all of those people have the potential to collect data on the exact, current condition of all those roads. If a community wants a better map, they can go out and build it.\" On the left is Google and the right is @Hivemapper .~10 yrs apart in Romania. pic.twitter.com/VofBM91hZg— ariel seidman (@aseidman) April 11, 2023 The Hivemapper marketplace rewards contributors for collecting data and doing QA to confirm images collected by others. It then offers its data to consumers as an alternative to Google Maps API. Millions of companies rely on Google Maps API to power their location data, and the service’s prices have increased substantially in recent years. Hivemapper’s first target clients are large entities that can integrate multiple sources of road data — logistics and mapping companies who can use Hivemapper’s growing database to improve the coverage and freshness of their existing data. Once the network gets close to 100 percent coverage, Nelson says, they’ll be able to compete directly with existing map products — first for apps that use Google Maps API, and then for individuals. (While a Waze-esque consumer product is certainly a long-term goal, Nelson says, Hivemapper’s current focus is business to business.) “There’s a lot of frustration with the with the high cost and the low freshness of the incumbent solutions in the market, and we see a real opportunity to use the power of decentralization to come into the market with something that really hits on the Achilles heel of those incumbent solutions, something that has lower collection costs and has higher freshness,” Nelson says. Using Solana to build community-powered infrastructureHivemapper is part of a larger Decentralized Physical Infrastructure Networks (DePIN) movement, which aims to replace the many monopolies and centralized institutions that have become fixtures of industrialized society with more communal solutions. The Hivemapper Dashcam S. Courtesy: Hivemapper“Decentralized infrastructure is basically a broad category of projects that are attempting to build real physical infrastructure networks, and are using token incentives in the blockchain to help get that going,” explains Kuleen Nikmar, an ecosystem development lead at the Solana Foundation. “If you’re trying to do something like build a new map, and you’re starting from zero, that’s going to take a huge amount of money and time and effort across the globe. A project like Hivemapper can say hey, set up some hardware and help us do this, and we’ll reward you. It’s proven to be pretty effective, and it’s a really compelling way to get over that cold start problem.”One of the best known DePIN projects is Helium, which uses a decentralized global network of Hotspots to connect Internet of Things (IoT) devices. But other startups are working on decentralizing everything from the cloud to the power grid. In addition to being easier to get off the ground, Nikmar explains, DePIN projects have the potential to reward everyday people for helping to build the infrastructure they rely upon.“If you think about maps as a concept, we’re literally talking about the world we all live in,” Nikmar says. “It seems really fitting to me that we should all contribute to our understanding of the world we live in collectively—and that if I contribute, then I should also get rewarded.”In the four months since launching the network, Hivemapper has done more than 11 million transactions to reward users for map improvement and to burn tokens spent by companies that use the map data. Because QA testers can sign up from anywhere without participating in the dash cam data collection, the company has seen exponential growth in the scale of transactions. To do this, Hivemapper takes advantage of state compression, which uses Merkle trees to \"compress\" the verification of a data tree into a hash or fingerprint of its current state. “The ability to compress those transactions with Merkle trees has been a huge enabler for us in terms of the cost and speed of maintaining that reward cycle,” Nelson says. Companies wishing to use Hivemapper’s maps will have to burn HONEY tokens, he explains, which will drive up their value and further incentivize dash cam users and QA testers to improve the map’s freshness. “If we together can build an incredibly powerful map product for those end users, then those tokens are in high demand,” Nelson says. “It’s super early days. We've made amazing progress with more than three million miles of mapping, but we've got something like 40 million to go. We’ve got a long road ahead of us, but we’re focused on doing maps better than anyone has done them before.\"Keep up to date.Hear about the latest news in the Solana ecosystem. Sign up for the Solana Community Update.Sign UpManaged by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 8678,
      "headings": [
        {
          "level": 1,
          "text": "Case Study: Hivemapper decentralizes mapping with better real-time data and community incentives"
        },
        {
          "level": 2,
          "text": "Keep up to date."
        },
        {
          "level": 3,
          "text": "Using Solana to build community-powered infrastructure"
        }
      ],
      "scraped_at": "2025-07-12 22:05:23"
    },
    "https://solana.com/developers/payments": {
      "url": "https://solana.com/developers/payments",
      "title": "Decentralized payments at scale | Solana",
      "description": "Solana’s high throughput and low fees make it a perfect fit for merchants to accept stablecoin payments.\n",
      "content": "Decentralized payments at scale | SolanaLearnDevelopersSolutionsNetworkCommunitySearchDocumentationAPICookbookGet Support Decentralized payments at scaleSolana’s high throughput and low fees make it a perfect fit for merchants to accept stablecoin payments.Get StartedLEARN MORE ABOUT SOLANA PAY$695M+USDC in circulation on Solana280Kactive daily accounts$0.00025avg transaction fee (stats as of 1/31/22)Getting startedEcosystem projects have provided reference implementations to get you started on Solana in record speed.Developer docsGetting started? Learn everything you need to know about payments on Solana in our developer docs.Read The DocsSolana Pay on ShopifyInstant, fee-free transactions are now available to millions of businesses with the Solana Pay app integration on Shopify.Install the appSolana Pay brand guidelinesImplementing Solana Pay? Get the lowdown on the design and brand guidelines.View GuidelinesCreate the next generation of merchant payment and commerce rails built on Solana technology - the only solution for low cost, instant settlement for online and in-store payments.why solanaThe next payment rail is hereEliminate feesStop paying interchange and other fees that erode top line revenue. Solana fees are a fraction of a cent.Incentivize your customersShare the incremental value with customers with on-chain rewards and loyalty offerings.Capture new revenueSettle payments in milliseconds instead of days and immediately earn high yield on your USD stablecoins.Own your relationshipsRemove intermediaries. Become a merchant that works directly with your customer.ANCHOR FRAMEWORKBuild the future togetherSolana’s blockchain enables the core building blocks for the future of commerce. If you’re ready to build the next generation of payments, loyalty and offers solutions, we want to hear from you.learn about turnkey solutions Join the CommunitySolana DiscordSolana ForumsManaged by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 2104,
      "headings": [
        {
          "level": 1,
          "text": "Decentralized payments at scale"
        },
        {
          "level": 2,
          "text": "Getting started"
        },
        {
          "level": 2,
          "text": "Developer docs"
        },
        {
          "level": 2,
          "text": "Solana Pay on Shopify"
        },
        {
          "level": 2,
          "text": "Solana Pay brand guidelines"
        },
        {
          "level": 2,
          "text": "Create the next generation of merchant payment and commerce rails built on Solana technology - the only solution for low cost, instant settlement for online and in-store payments."
        },
        {
          "level": 2,
          "text": "The next payment rail is here"
        },
        {
          "level": 2,
          "text": "Build the future together"
        },
        {
          "level": 2,
          "text": "Join the Community"
        },
        {
          "level": 3,
          "text": "$695M+"
        },
        {
          "level": 3,
          "text": "280K"
        },
        {
          "level": 3,
          "text": "$0.00025"
        },
        {
          "level": 3,
          "text": "Eliminate fees"
        },
        {
          "level": 3,
          "text": "Incentivize your customers"
        },
        {
          "level": 3,
          "text": "Capture new revenue"
        },
        {
          "level": 3,
          "text": "Own your relationships"
        }
      ],
      "scraped_at": "2025-07-12 22:05:25"
    },
    "https://solana.com/youtube": {
      "url": "https://solana.com/youtube",
      "title": "Solana - YouTube",
      "description": "The high performance network powering internet capital markets, payments, and crypto applications. Subscribe for updates, video podcast episodes, developer g...",
      "content": "Solana - YouTubeAboutPressCopyrightContact usCreatorAdvertiseDevelopersTermsPrivacyPolicy & SafetyHow YouTube worksTest new features© 2025 Google LLC",
      "content_length": 149,
      "headings": [],
      "scraped_at": "2025-07-12 22:05:26"
    },
    "https://solana.com/twitter": {
      "url": "https://solana.com/twitter",
      "title": "No Title",
      "description": "",
      "content": "JavaScript is not available. We’ve detected that JavaScript is disabled in this browser. Please enable JavaScript or switch to a supported browser to continue using x.com. You can see a list of supported browsers in our Help Center. Help Center Terms of Service Privacy Policy Cookie Policy Imprint Ads info © 2025 X Corp. Something went wrong, but don’t fret — let’s give it another shot.Try again Some privacy related extensions may cause issues on x.com. Please disable them and try again.",
      "content_length": 492,
      "headings": [
        {
          "level": 1,
          "text": "JavaScript is not available."
        }
      ],
      "scraped_at": "2025-07-12 22:05:27"
    },
    "https://solana.com/discord": {
      "url": "https://solana.com/discord",
      "title": "Solana Tech",
      "description": "Check out the Solana Tech community on Discord - hang out with 146655 other members and enjoy free voice and text chat.",
      "content": "Solana Tech",
      "content_length": 11,
      "headings": [],
      "scraped_at": "2025-07-12 22:05:29"
    },
    "https://solana.com/reddit": {
      "url": "https://solana.com/reddit",
      "title": "Reddit - The heart of the internet",
      "description": "",
      "content": "Reddit - The heart of the internet Skip to main content Open menu Open navigation Go to Reddit Home r/solana A chip A close button Get App Get the Reddit app Log In Log in to Reddit Expand user menu Open settings menu r/solana members online Create Post Feed About Best Open sort options Best Hot New Top Rising Change post view Card Compact Community highlights Weekly Discussion Thread Weekly Discussion votes • comments Welcome to /r/Solana - Read This To Get Started Please Read votes • comments Colosseum Codex: Solana MCP Server, Alpenglow Report, Codigo Weekly Digest vote • comment Application For The \"Solana Scaling Summer\", Kumeka Team's Accelerator, Is Now Open, With $100K+ In Insta-Grants | Kicks Off July 21 Ecosystem votes • comment RadiantsDAO - The \"$100,000 Solana Mobile Hackathon\" Will Run From July 1st To August 4th SolanaMobile votes • comment POV: You import your old wallet into Backpack and check the DeFi tab. u/CarefulCan7134 • POV: You import your old wallet into Backpack and check the DeFi tab. Ecosystem u/BlockMaster3000 • Promoted Flipside is hosting quests to guide your journey into the Stellar DeFi ecosystem. Each quest helps familiarize yourself with fundamental DeFi operations. flipsidecrypto.xyz Learn More Did i get scammed? (What do I do?) u/nickai0594 • Did i get scammed? (What do I do?) Wallet/Exchange Attention newbs: Get a hardware wallet... u/dolmdemon • Attention newbs: Get a hardware wallet... Ecosystem .. if you intend to hold more than you are willing to lose in assets. Secure your working wallet, or use a cold storage wallet with hardware and only risk portions in a hot wallet. Seems like daily there's new posts here of people pleading for help after losing everything with no idea how. It happened to me too. Hardware Wallets dont solve every problem, but they make it pretty much impossible to get robbed by methods that steal your private key or hack your browser extension. Buy one directly from the manufacturer (not ebay, Amazon, Walmart, etc). Im a fan of the Ledger devices myself. The Ledger Live app makes it stupid easy to swap assets cross-chain. I have the Nano S Plus and Flex. The Nano is easier to use in my opinion. Private Key Security – Your private key never leaves the device, protecting it from malware and scraping. Protection from Hacks – Even if your computer is compromised, your SOL and tokens remain secure. Transaction Verification – You physically confirm every transaction on/with the device, preventing spoofed or malicious actions. Solana App Support – Major hardware wallets like Ledger support Solana natively through tools like Solflare and Phantom. DeFi & NFT Safety – Safely interact with Solana DeFi and NFT platforms without exposing your hot wallet to risks. Ledger Nano S Plus Price: ~$55 (On sale) Website: ledger.com Notes: Reliable, widely supported by Solflare and Phantom, best value for Solana DeFi and NFTs. SafePal S1 Price: $49.99 Website: safepal.com Notes: Air‑gapped, CC EAL6+ secure element, supports Solana via SafePal mobile app . Tangem Wallet (2-card pack) Price: ~$55 Website: tangem.com Notes: Mobile-first NFC wallet, supports Solana through their app, very portable. Top 1% Rank by size Created Mar 27, 2018 Public Anyone can view, post, and comment to this community Community Bookmarks Network Analysis Solana Explorer Solana Beach SolScan SolanaFM Staking Resources Stake Pools Choosing a Validator Validator Stats Dev Community Solana StackExchange Solana Tech Discord Solana DevList NeonLabs EVM Discord Dev Resources Solana GitHub All Dev Resources Solana Docs Solana Developers SolDev.app Solana Cookbook Solana Dev Twitter Metaplex NFT Devs Promoted Get Started With Solana Solana.com Solana.com Community Newsletter Community Newsletter Solana Ecosystem Solana Ecosystem Developer Resources Developer Resources Become a Validator Become a Validator Solana Changelog (Tech) Solana Changelog (Tech) Solana - Updated Guide Solana - Updated Guide Community Make Sure To Check The Below Links For Trading / Random Talks (Weekly Discussion) & Learn More About How To avoid Crypto Scams (How To Avoid Scams). Weekly Discussion Weekly Discussion How To Avoid Scams How To Avoid Scams Filter by Topic Ecosystem DeFi Staking Dev/Tech Wallet/Exchange NFT/Gaming Meme Moderators Moderator list hidden. Learn More View all moderators Promoted Reddit Rules Privacy Policy User Agreement Accessibility Reddit, Inc. © 2025. All rights reserved. Expand Navigation Collapse Navigation &nbsp; &nbsp; &nbsp; TOPICS Internet Culture (Viral) Amazing Animals & Pets Cringe & Facepalm Funny Interesting Memes Oddly Satisfying Reddit Meta Wholesome & Heartwarming Games Action Games Adventure Games Esports Gaming Consoles & Gear Gaming News & Discussion Mobile Games Other Games Role-Playing Games Simulation Games Sports & Racing Games Strategy Games Tabletop Games Q&As Q&As Stories & Confessions Technology 3D Printing Artificial Intelligence & Machine Learning Computers & Hardware Consumer Electronics DIY Electronics Programming Software & Apps Streaming Services Tech News & Discussion Virtual & Augmented Reality Pop Culture Celebrities Creators & Influencers Generations & Nostalgia Podcasts Streamers Tarot & Astrology Movies & TV Action Movies & Series Animated Movies & Series Comedy Movies & Series Crime, Mystery, & Thriller Movies & Series Documentary Movies & Series Drama Movies & Series Fantasy Movies & Series Horror Movies & Series Movie News & Discussion Reality TV Romance Movies & Series Sci-Fi Movies & Series Superhero Movies & Series TV News & Discussion RESOURCES About Reddit Advertise Reddit Pro BETA Help Blog Careers Press Communities Best of Reddit Top Translated Posts Topics",
      "content_length": 5719,
      "headings": [
        {
          "level": 1,
          "text": "r/solana"
        },
        {
          "level": 2,
          "text": "Weekly Discussion Thread"
        },
        {
          "level": 2,
          "text": "Welcome to /r/Solana - Read This To Get Started"
        },
        {
          "level": 2,
          "text": "Colosseum Codex: Solana MCP Server, Alpenglow Report, Codigo"
        },
        {
          "level": 2,
          "text": "Application For The \"Solana Scaling Summer\", Kumeka Team's Accelerator, Is Now Open, With $100K+ In Insta-Grants  | Kicks Off July 21"
        },
        {
          "level": 2,
          "text": "RadiantsDAO - The \"$100,000 Solana Mobile Hackathon\" Will Run From July 1st To August 4th"
        },
        {
          "level": 2,
          "text": "Community Bookmarks"
        },
        {
          "level": 2,
          "text": "Get Started With Solana"
        },
        {
          "level": 2,
          "text": "Community"
        },
        {
          "level": 2,
          "text": "Filter by Topic"
        },
        {
          "level": 2,
          "text": "Moderators"
        },
        {
          "level": 3,
          "text": "Community highlights"
        }
      ],
      "scraped_at": "2025-07-12 22:05:31"
    },
    "https://solana.com/github": {
      "url": "https://solana.com/github",
      "title": "GitHub - solana-foundation/solana-com: The solana.com website.",
      "description": "The solana.com website. Contribute to solana-foundation/solana-com development by creating an account on GitHub.",
      "content": "GitHub - solana-foundation/solana-com: The solana.com website. Skip to content Navigation Menu Toggle navigation Sign in Appearance settings Product GitHub Copilot Write better code with AI GitHub Models New Manage and compare prompts GitHub Advanced Security Find and fix vulnerabilities Actions Automate any workflow Codespaces Instant dev environments Issues Plan and track work Code Review Manage code changes Discussions Collaborate outside of code Code Search Find more, search less Explore Why GitHub All features Documentation GitHub Skills Blog Solutions By company size Enterprises Small and medium teams Startups Nonprofits By use case DevSecOps DevOps CI/CD View all use cases By industry Healthcare Financial services Manufacturing Government View all industries View all solutions Resources Topics AI DevOps Security Software Development View all Explore Learning Pathways Events & Webinars Ebooks & Whitepapers Customer Stories Partners Executive Insights Open Source GitHub Sponsors Fund open source developers The ReadME Project GitHub community articles Repositories Topics Trending Collections Enterprise Enterprise platform AI-powered developer platform Available add-ons GitHub Advanced Security Enterprise-grade security features Copilot for business Enterprise-grade AI features Premium Support Enterprise-grade 24/7 support Pricing Search or jump to... Search code, repositories, users, issues, pull requests... Search Clear Search syntax tips Provide feedback We read every piece of feedback, and take your input very seriously. Include my email address so I can be contacted Cancel Submit feedback Saved searches Use saved searches to filter your results more quickly Name Query To see all available qualifiers, see our documentation. Cancel Create saved search Sign in Sign up Appearance settings Resetting focus You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert solana-foundation / solana-com Public Notifications You must be signed in to change notification settings Fork 180 Star 273 The solana.com website. solana.com License GPL-3.0 license 273 stars 180 forks Branches Tags Activity Star Notifications You must be signed in to change notification settings Code Issues 13 Pull requests 13 Actions Projects 0 Security Uh oh! There was an error while loading. Please reload this page. Insights Additional navigation options Code Issues Pull requests Actions Projects Security Insights solana-foundation/solana-com mainBranchesTagsGo to fileCodeOpen more actions menuFolders and filesNameNameLast commit messageLast commit dateLatest commit History474 Commits.cursor/rules.cursor/rules .github.github .husky.husky assetsassets contentcontent publicpublic srcsrc .editorconfig.editorconfig .env.example.env.example .eslintignore.eslintignore .eslintrc.json.eslintrc.json .gitignore.gitignore .prettierignore.prettierignore .prettierrc.prettierrc CONTRIBUTING.mdCONTRIBUTING.md LICENSELICENSE README.mdREADME.md components.jsoncomponents.json crowdin.ymlcrowdin.yml i18n.jsoni18n.json i18n.locki18n.lock jest.config.tsjest.config.ts jest.setup.tsjest.setup.ts llmtxt-generator.pyllmtxt-generator.py next-env.d.tsnext-env.d.ts next-i18next.config.jsnext-i18next.config.js next-sitemap.config.jsnext-sitemap.config.js next.config.mjsnext.config.mjs package.jsonpackage.json postcss.config.jspostcss.config.js rewrites-redirects.mjsrewrites-redirects.mjs sentry.edge.config.tssentry.edge.config.ts sentry.server.config.tssentry.server.config.ts source.config.tssource.config.ts tailwind.config.jstailwind.config.js tsconfig.jsontsconfig.json types.d.tstypes.d.ts yarn.lockyarn.lock View all filesRepository files navigationREADMEGPL-3.0 licensesolana.com Repository for https://solana.com. Setup locally Clone the repo to your local machine: git clone https://github.com/solana-foundation/solana-com.git Install the dependencies via yarn: yarn Run the project locally: yarn dev Maintainers The solana.com website is managed and maintained by the Solana Foundation. Read more on how to contribute. About The solana.com website. solana.com Topics react javascript typescript Resources Readme License GPL-3.0 license Uh oh! There was an error while loading. Please reload this page. Activity Custom properties Stars 273 stars Watchers 12 watching Forks 180 forks Report repository Uh oh! There was an error while loading. Please reload this page. Contributors 93 + 79 contributors Languages MDX 93.1% JavaScript 4.2% TypeScript 1.6% Other 1.1% Footer © 2025 GitHub, Inc. Footer navigation Terms Privacy Security Status Docs Contact Manage cookies Do not share my personal information You can’t perform that action at this time.",
      "content_length": 4839,
      "headings": [
        {
          "level": 1,
          "text": "Search code, repositories, users, issues, pull requests..."
        },
        {
          "level": 1,
          "text": "Provide feedback"
        },
        {
          "level": 1,
          "text": "Saved searches"
        },
        {
          "level": 1,
          "text": "solana-foundation/solana-com"
        },
        {
          "level": 1,
          "text": "solana.com"
        },
        {
          "level": 2,
          "text": "Navigation Menu"
        },
        {
          "level": 2,
          "text": "Use saved searches to filter your results more quickly"
        },
        {
          "level": 2,
          "text": "Folders and files"
        },
        {
          "level": 2,
          "text": "Latest commit"
        },
        {
          "level": 2,
          "text": "History"
        },
        {
          "level": 2,
          "text": "Repository files navigation"
        },
        {
          "level": 2,
          "text": "Setup locally"
        },
        {
          "level": 2,
          "text": "Maintainers"
        },
        {
          "level": 2,
          "text": "About"
        },
        {
          "level": 2,
          "text": "Contributors\n      93"
        },
        {
          "level": 2,
          "text": "Languages"
        },
        {
          "level": 2,
          "text": "Footer"
        },
        {
          "level": 3,
          "text": "License"
        },
        {
          "level": 3,
          "text": "Uh oh!"
        },
        {
          "level": 3,
          "text": "Topics"
        },
        {
          "level": 3,
          "text": "Resources"
        },
        {
          "level": 3,
          "text": "License"
        },
        {
          "level": 3,
          "text": "Uh oh!"
        },
        {
          "level": 3,
          "text": "Stars"
        },
        {
          "level": 3,
          "text": "Watchers"
        },
        {
          "level": 3,
          "text": "Forks"
        },
        {
          "level": 3,
          "text": "Uh oh!"
        },
        {
          "level": 3,
          "text": "Footer navigation"
        }
      ],
      "scraped_at": "2025-07-12 22:05:33"
    },
    "https://solana.com/telegram": {
      "url": "https://solana.com/telegram",
      "title": "Telegram: View @solana",
      "description": "",
      "content": "Telegram: View @solana Download Solana 69 780 members, 2 939 online High performance blockchain based on Proof of History. https://solana.comThis account is owned and operated by the Solana Foundation. This group is used for informational purposes only. View in Telegram If you have Telegram, you can view and join Solana right away.",
      "content_length": 333,
      "headings": [],
      "scraped_at": "2025-07-12 22:05:34"
    },
    "https://solana.com/branding": {
      "url": "https://solana.com/branding",
      "title": "Brand & Press | Solana",
      "description": "Learn about Solana's branding guidelines, download assets, and contact our press team.",
      "content": "Brand & Press | SolanaLearnDevelopersSolutionsNetworkCommunitySearchBrand & PressWelcome to Solana Brand & Marketing pageFollow these guidelines when promoting Solana in marketing communications, including advertising, articles, websites, and printed promotions.For full brand guidelines please see Solana Foundation Brand Guidelines.Solana BrandLogotypeSolana’s wordmark is constructed from custom-built, modular type. The angular and uniform lettering takes cues from 1980s tech aesthetics, updated to feel fresh and futuristic. The logomark is created by stacking three identical parallelograms. It conveys speed and celebrates the concept of building.ClearspaceA certain amount of space is needed around the logomark to prevent it from becoming cluttered by surrounding artwork, images, or the edge of a page. Below are the minimum spacings for both logomark and wordmark.Logo Dont’sHere are some things you should never do with the Solana logomark.Don’t add shadows behind the logoDon’t add outlines to the logoDon’t stretch the logoDon’t apply logo in low resolutionDon’t use logo as a frame for imageryDon’t place on low contrast colorsColorssolana gradientPNGsolana purple#9945FFsolana green#14F195AssetsDownload assetsMain logotypePNGSVGLogomarkPNGSVGWordmarkPNGSVGVertical lockupPNGSVGFoundation logotypePNGSVGPress inquiriesPlease direct inquiries to press@solana.org.ContentsBrand guidelinesAsset downloadsPress inquiriesManaged by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 1628,
      "headings": [
        {
          "level": 1,
          "text": "Brand & Press"
        },
        {
          "level": 2,
          "text": "Solana Brand"
        },
        {
          "level": 2,
          "text": "Assets"
        },
        {
          "level": 2,
          "text": "Press inquiries"
        }
      ],
      "scraped_at": "2025-07-12 22:05:35"
    },
    "https://solana.com/tos": {
      "url": "https://solana.com/tos",
      "title": "Terms of Service | Solana",
      "description": "Terms of service, agreement to terms and more.",
      "content": "Terms of Service | SolanaLearnDevelopersSolutionsNetworkCommunitySearchTerms of ServiceTERMS OF SERVICEPlease read these terms carefully and keep a copy of them for your reference. Please also note that there may be specific terms or conditions applicable to you as a user in a given jurisdiction, as detailed below.Please refer to our Privacy Policy, available at link, for information about how we collect, use, share and otherwise process information about you.AGREEMENT TO TERMSThis End User License Agreement and Terms of Service (“EULA” or “Terms”) is a binding contract between you, an individual user or site visitor, whether personally or on behalf of an entity (“user,” “you,” “your”) and the Solana Foundation (the “Foundation,” “we,” “us” or “our”) concerning use of the Foundation’s services (the “Service”), including the www.solana.com website as well as any other media form, media channel, or mobile website related, linked, or otherwise connected thereto (collectively, the “Site”). Currently, the Foundation maintains and operates www.solana.com as a portal for news, information, and updates about the Solana protocol or blockchain (the “Solana Network”) and the Solana ecosystem. For the avoidance of doubt, the Foundation does not control the Solana Network and cannot control activity and data on the Solana Network, the activities of persons who develop and use applications on the Network, the validation of transactions on the Solana Network, or use of the Solana Network. Solana The Network is an open-source protocol that is maintained and processed by Solana Network validators across the globe.BY ACCESSING OR USING THE SERVICE, YOU AGREE THAT YOU HAVE READ, UNDERSTOOD, AND AGREE TO BE BOUND BY THE EULA. IF YOU DO NOT AGREE, PLEASE DO NOT USE THE SERVICE OR SITE.Supplemental terms and conditions or documents that may be posted on the Site from time to time are hereby expressly incorporated herein by reference. We reserve the right, in our sole discretion, to make changes or modifications to this EULA at any time and for any reason. We will alert you about any changes by updating the “Last updated” date of the EULA, and you waive any right to receive specific notice of each such change. It is your responsibility to periodically review the EULA to stay informed of updates. You will be subject to, and will be deemed to have been made aware of and to have accepted, the changes in any revised EULA by your continued use of the Service after the date such revised EULA is posted.The information provided on the Site is not intended for distribution to or use by any person or entity in any jurisdiction or country where such distribution or use would be contrary to law or regulation or which would subject us to any registration requirement within such jurisdiction or country. Accordingly, those persons who choose to access the Site from other locations do so on their own initiative and are solely responsible for compliance with local laws, if and to the extent local laws are applicable.The Service is intended for users who are at least 18 years old. You agree that by using the Site and the Service you are at least 18 years of age, or accessing the Service under the supervision of a parent or guardian, and you are legally able to enter into a contract. If you are a parent or legal guardian of a user under the age of 18 (or the age of legal majority), you agree to be fully responsible for the acts or omissions of such user in relation to the Service. If you use the Service on behalf of another person or entity, (a) all references to “you” throughout the EULA will include that person or entity, (b) you represent that you are authorized to accept these Terms on that person’s or entity’s behalf, and (c) in the event you or the person or entity violates these Terms, the person or entity agrees to be responsible to us.PLEASE NOTE: THE “DISPUTE RESOLUTION” SECTION OF THIS EULA CONTAINS AN ARBITRATION CLAUSE THAT REQUIRES DISPUTES TO BE ARBITRATED ON AN INDIVIDUAL BASIS, AND PROHIBITS CLASS ACTION CLAIMS. IT AFFECTS HOW DISPUTES BETWEEN YOU AND THE FOUNDATION ARE RESOLVED. BY ACCEPTING THIS EULA, YOU AGREE TO BE BOUND BY THIS ARBITRATION PROVISION. PLEASE READ IT CAREFULLY.SCOPE OF LICENSE TO USERSThe Service is licensed, not sold, to you for use only under the terms of the EULA, subject to your complete and ongoing compliance with the terms and conditions of the EULA. The Foundation hereby grants you a personal, limited, revocable, non-transferable license to access and use the Service solely for your own use.You may not modify, alter, reproduce, or distribute the Service. You may not directly rent, lease, lend, sell, redistribute or sublicense the Service. You may not copy, decompile, reverse engineer, disassemble, attempt to derive the source code of, modify, or create derivative works of any portion of the Service, any updates, or any part thereof (except as and only to the extent any foregoing restriction is prohibited by applicable law), nor attempt to disable or circumvent any security or other technological measure designed to protect the Service or any content available through the Service. If you breach these license restrictions, or otherwise exceed the scope of the licenses granted in the EULA, then you may be subject to prosecution and damages, as well as liability for infringement of intellectual property rights, and denial of access to the Service.WITHOUT LIMITING ANY OTHER PROVISION OF THIS EULA, WE RESERVE THE RIGHT TO, IN OUR SOLE DISCRETION AND WITHOUT NOTICE OR LIABILITY, DENY ACCESS TO AND USE OF THE SERVICE (INCLUDING BLOCKING CERTAIN IP ADDRESSES), TO ANY PERSON FOR ANY REASON OR FOR NO REASON, INCLUDING WITHOUT LIMITATION FOR BREACH OF ANY REPRESENTATION, WARRANTY, OR COVENANT CONTAINED IN THIS EULA OR OF ANY APPLICABLE LAW OR REGULATION. WE MAY TERMINATE YOUR USE OR PARTICIPATION IN THE SITE AT ANY TIME, WITHOUT WARNING, IN OUR SOLE DISCRETION. If we terminate or suspend your access to the Site for any reason, you are prohibited from attempting to access the Site under your name, a fake or borrowed name, or the name of any third party, even if you may be acting on behalf of the third party. In addition to terminating or suspending your access, we reserve the right to take appropriate legal action, including without limitation pursuing civil, criminal, and injunctive redress.PROHIBITED ACTIVITIESYou may not access or use the Service for any purpose other than that for which we make the Service available. The Service may not be used in connection with any commercial endeavors except those that are specifically endorsed or approved by us.As a user of the Service, you agree not to:Systematically retrieve data or other content from the Service to create or compile, directly or indirectly, a collection, compilation, database, or directory without written permission from us.Make any unauthorized use of the Service, including collecting usernames and/or email addresses of users by electronic or other means for the purpose of sending unsolicited email, or creating user accounts by automated means or under false pretenses.Circumvent, disable, or otherwise interfere with security-related features of the Service, including features that prevent or restrict the use or copying of any content or enforce limitations on the use of the Service and/or the content contained therein.Engage in unauthorized framing of or linking to the Site.Trick, defraud, or mislead us and other users, especially in any attempt to learn sensitive account information such as user passwords.Make improper use of our support services or submit false reports of abuse or misconduct.Engage in any automated use of the system, such as using scripts to send comments or messages, or using any data mining, robots, or similar data gathering and extraction tools.Interfere with, disrupt, or create an undue burden on the Site or the networks or services connected to the Site.Attempt to impersonate another user or person.Use any information obtained from the Site in order to harass, abuse, or harm another person.Use the Service as part of any effort to compete with us or otherwise use the Service and/or the content for any revenue-generating endeavor or commercial enterprise.Decipher, decompile, disassemble, or reverse engineer any of the software comprising or in any way making up a part of the Site.Harass, annoy, intimidate, or threaten any of our employees or agents engaged in providing any portion of the Service to you.Attempt to bypass any measures of the Site designed to prevent or restrict access to the Site, or any portion of the Site.Delete the copyright or other proprietary rights notice from any content.Copy or adapt the Site’s software, including but not limited to Flash, PHP, HTML, JavaScript, or other code.Upload or transmit (or attempt to upload or to transmit) viruses, Trojan horses, or other material, including excessive use of capital letters and spamming (continuous posting of repetitive text), that interferes with any party’s uninterrupted use and enjoyment of the Service or modifies, impairs, disrupts, alters, or interferes with the use, features, functions, operation, or maintenance of the Service.Upload or transmit (or attempt to upload or to transmit) any material that acts as a passive or active information collection or transmission mechanism, including without limitation, clear graphics interchange formats (“gifs”), 1×1 pixels, web bugs, cookies, or other similar devices (sometimes referred to as “spyware” or “passive collection mechanisms” or “pcms”).Except as may be the result of standard search engine or Internet browser usage, use, launch, develop, or distribute any automated system, including without limitation, any spider, robot, cheat utility, scraper, or offline reader that accesses the Site, or using or launching any unauthorized script or other software.Disparage, tarnish, distribute hate speech/explicit content or otherwise harm, in our opinion, us, the Service and/or other users of the Service.Copy, reproduce, distribute, publicly perform or publicly display all or portions of our Service, except as expressly permitted by us or our licensors.Modify our Service, remove any proprietary rights notices or markings, or otherwise make any derivative works based upon our Service.Infringe any patent, trademark, trade secret, copyright or other intellectual or proprietary right of the Foundation or any third party.Use the Service in a manner inconsistent with any applicable laws or regulations.SITE MANAGEMENTWe reserve the right, but not the obligation, to: (1) monitor the Site for violations of this EULA; (2) take appropriate legal action against anyone who, in our sole discretion, violates the law or this EULA, including without limitation, reporting such user to law enforcement authorities; (3) in our sole discretion and without limitation, notice, or liability, to remove from the Site or otherwise disable all files and content that are excessive in size or are in any way burdensome to our systems; and (4) otherwise manage the Site in a manner designed to protect our rights and property and to facilitate the proper functioning of the Site.TRADEMARKS“Solana” and our logos, our product or service names, our slogans and the look and feel of the Service are trademarks of the Foundation and may not be copied, imitated or used, in whole or in part, without our prior written permission, which may be obtained by emailing operations@solana.foundation. All other trademarks, registered trademarks, product names and company names or logos mentioned on the Service are the property of their respective owners. Reference to any products, services, processes or other information by trade name, trademark, manufacturer, supplier or otherwise does not constitute or imply endorsement, sponsorship or recommendation by us.DISPUTE RESOLUTIONPlease read the following section carefully because it requires you to arbitrate certain disputes and claims with the Foundation and limits the manner in which you can seek relief from us, unless you opt out of arbitration by following the instructions set forth below. No class or representative actions or arbitrations are allowed under this arbitration provision. In addition, arbitration precludes you from suing in court or having a jury trial. **(a) No Representative Actions. You and the Foundation agree that any dispute arising out of or related to this EULA or the Service is personal to you and the Foundation and that any dispute will be resolved solely through individual action, and will not be brought as a class arbitration, class action or any other type of representative proceeding.(b) Arbitration of Disputes. You and the Foundation waive your rights to a jury trial and to have any other dispute arising out of or related to this EULA and the Service, including claims related to privacy and data security, (collectively, “Disputes”) resolved in court. Instead, for any Dispute that you have against the Foundation you agree to first contact the Foundation and attempt to resolve the claim informally by sending a written notice of your claim (“Notice”) to the Foundation by email at operations@solana.foundation or by certified mail addressed to Dammstrasse 16, 6300 Zug, Switzerland. The Notice must (a) include your name, residence address, email address, and telephone number; (b) describe the nature and basis of the Dispute; and (c) set forth the specific relief sought. Our notice to you will be similar in form to that described above. If you and the Foundation cannot reach an agreement to resolve the Dispute within thirty (30) days after such Notice is received, then either party may submit the Dispute to binding arbitration administered by JAMS or, under the limited circumstances set forth above, in court. All Disputes submitted to JAMS will be resolved through confidential, binding arbitration before one arbitrator. Arbitration proceedings will be held in Zug, Switzerland. You and the Foundation agree that Disputes will be held in accordance with the JAMS Streamlined Arbitration Rules and Procedures (“JAMS Rules”). The most recent version of the JAMS Rules are available on the JAMS website and are hereby incorporated by reference. You either acknowledge and agree that you have read and understand the JAMS Rules or waive your opportunity to read the JAMS Rules and waive any claim that the JAMS Rules are unfair or should not apply for any reason.(c) You and the Foundation agree that these Terms affect interstate commerce and that the enforceability of this Section will be substantively and procedurally governed by the Federal Arbitration Act, 9 U.S.C. § 1, et seq. (the “FAA”), to the maximum extent permitted by applicable law. As limited by the FAA, these Terms and the JAMS Rules, the arbitrator will have exclusive authority to make all procedural and substantive decisions regarding any Dispute and to grant any remedy that would otherwise be available in court, including the power to determine the question of arbitrability. The arbitrator may conduct only an individual arbitration and may not consolidate more than one individual’s claims, preside over any type of class or representative proceeding or preside over any proceeding involving more than one individual.(d) The arbitration will allow for the discovery or exchange of non-privileged information relevant to the Dispute. The arbitrator, the Foundation, and you will maintain the confidentiality of any arbitration proceedings, judgments and awards, including information gathered, prepared and presented for purposes of the arbitration or related to the Dispute(s) therein. The arbitrator will have the authority to make appropriate rulings to safeguard confidentiality, unless the law provides to the contrary. The duty of confidentiality does not apply to the extent that disclosure is necessary to prepare for or conduct the arbitration hearing on the merits, in connection with a court application for a preliminary remedy or in connection with a judicial challenge to an arbitration award or its enforcement, or to the extent that disclosure is otherwise required by law or judicial decision.(e) You and the Foundation agree that for any arbitration you initiate, you will pay the filing fee (up to a maximum of \\$250 if you are a consumer), and the Foundation will pay the remaining JAMS fees and costs. For any arbitration initiated by the Foundation, the Foundation will pay all JAMS fees and costs. You and the Foundation agree that the Kanton of Zug shall have exclusive jurisdiction over any appeals and the enforcement of an arbitration award. []{#h.lnxbz9 .anchor}(f) Any Dispute must be filed within one year after the relevant claim arose; otherwise, the Dispute is permanently barred, which means that you and the Foundation will not have the right to assert the claim. []{#h.35nkun2 .anchor}(g) You have the right to opt out of binding arbitration within 30 days of the date you first accepted the terms of this Section by mailing an opt-out notice to the Foundation at Dammstrasse 16, 6300 Zug, Switzerland. In order to be effective, the opt-out notice must include your full name and address and clearly indicate your intent to opt out of binding arbitration. By opting out of binding arbitration, you are agreeing to resolve Disputes in accordance with the governing law and venue terms of this EULA.(h) If any portion of this Section is found to be unenforceable or unlawful for any reason, (a) the unenforceable or unlawful provision shall be severed from these Terms; (b) severance of the unenforceable or unlawful provision shall have no impact whatsoever on the remainder of this Section or the parties’ ability to compel arbitration of any remaining claims on an individual basis pursuant to this Section; and (c) to the extent that any claims must therefore proceed on a class, collective, consolidated, or representative basis, such claims must be litigated in a civil court of competent jurisdiction and not in arbitration, and the parties agree that litigation of those claims shall be stayed pending the outcome of any individual claims in arbitration. Further, if any part of this Section is found to prohibit an individual claim seeking public injunctive relief, that provision will have no effect to the extent such relief is allowed to be sought out of arbitration, and the remainder of this Section will be enforceable.GOVERNING LAW AND VENUEAny dispute arising from these Terms and your use of the Service will be governed by and construed and enforced in accordance with the laws of Switzerland. Any dispute between the parties that is not subject to arbitration will be resolved in Zug, Switzerland.CORRECTIONSThere may be information on the Site that contains typographical errors, inaccuracies, or omissions, including descriptions, pricing, availability, and various other information. We reserve the right to correct any errors, inaccuracies, or omissions and to change or update the information on the Site at any time, without prior notice. The Foundation does not warrant that the content will be uninterrupted or error free or free of computer viruses, contaminants or other harmful items.DISCLAIMERTHE SITE AND SERVICE IS PROVIDED ON AN “AS-IS” AND “AS-AVAILABLE” BASIS. TO THE MAXIMUM EXTENT PERMITTED BY LAW, THE FOUNDATION WILL NOT BE LIABLE FOR ANY DAMAGES OF ANY KIND ARISING FROM THE USE OF THE SITE OR SERVICE, INCLUDING, BUT NOT LIMITED TO INDIRECT, INCIDENTAL, PUNITIVE, EXEMPLARY, SPECIAL OR CONSEQUENTIAL DAMAGES, EVEN IF WE HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. YOU AGREE THAT YOUR USE OF THE SITE AND SERVICE WILL BE AT YOUR SOLE RISK. THE FOUNDATION IS NOT RESPONSIBLE FOR ANY DAMAGES OR LOSSES THAT RESULT FROM YOUR USE OF THE SERVICE, INCLUDING, BUT NOT LIMITED TO, YOUR USE OR INABILITY TO USE THE SERVICE; ANY CHANGES TO OR INACCESSIBILITY OR TERMINATION OF THE SERVICE; ANY DELAY, FAILURE, UNAUTHORIZED ACCESS TO, OR ALTERATION OF ANY TRANSMISSION OR DATA; ANY TRANSACTION OR AGREEMENT ENTERED INTO THROUGH THE SERVICE; ANY ACTIVITIES OR COMMUNICATIONS OF THIRD PARTIES; OR ANY DATA OR MATERIAL FROM A THIRD PERSON ACCESSED ON OR THROUGH THE SERVICES. WE MAKE NO WARRANTIES OR REPRESENTATIONS ABOUT THE ACCURACY OR COMPLETENESS OF THE SITE’S CONTENT OR THE CONTENT OF ANY WEBSITES LINKED TO THE SITE AND WE WILL ASSUME NO LIABILITY OR RESPONSIBILITY FOR ANY (1) ERRORS, MISTAKES, OR INACCURACIES OF CONTENT AND MATERIALS, (2) PERSONAL INJURY OR PROPERTY DAMAGE, OF ANY NATURE WHATSOEVER, RESULTING FROM YOUR ACCESS TO AND USE OF THE SITE OR SERVICE, (3) ANY UNAUTHORIZED ACCESS TO OR USE OF OUR SECURE SERVERS AND/OR ANY AND ALL PERSONAL INFORMATION AND/OR FINANCIAL INFORMATION STORED THEREIN, (4) ANY INTERRUPTION OR CESSATION OF TRANSMISSION TO OR FROM THE SITE, (5) ANY BUGS, VIRUSES, TROJAN HORSES, OR THE LIKE WHICH MAY BE TRANSMITTED TO OR THROUGH THE SITE BY ANY THIRD PARTY, AND/OR (6) ANY ERRORS OR OMISSIONS IN ANY CONTENT AND MATERIALS OR FOR ANY LOSS OR DAMAGE OF ANY KIND INCURRED AS A RESULT OF THE USE OF ANY CONTENT POSTED, TRANSMITTED, OR OTHERWISE MADE AVAILABLE VIA THE SITE.IF YOU ARE DISSATISFIED WITH THE SERVICE, YOU AGREE THAT YOUR SOLE AND EXCLUSIVE REMEDY SHALL BE FOR YOU TO DISCONTINUE YOUR USE OF THE SERVICE. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE LIMITATION AND EXCLUSIONS MAY NOT APPLY TO YOU.The Foundation may link to products and services offered by third parties through the Service. These third-party products and services are not offered by the Foundation and the Foundation is not responsible for any damages or losses that you might incur as a result of your use or purchase of these products and services.You shall and hereby do waive California Civil Code Section 1542 or any other similar law of any jurisdiction, which says in substance: “A general release does not extend to claims which the creditor does not know or suspect to exist in his favor at the time of executing the release, which, if known by him must have materially affected his settlement with the debtor.” Some jurisdictions do not allow the exclusion of implied warranties, so the above exclusion may not apply to you. You may have other rights which vary from jurisdiction to jurisdiction.INDEMNIFICATIONYou hereby agree to defend, indemnify, and hold the Foundation harmless from and against any loss, damage, liability, claim, or demand, including reasonable attorneys’ fees and expenses, made by any third party due to or arising out of: (1) use of the Service; (2) breach of this EULA; (3) any breach of your representations and warranties set forth in this EULA; (4) your violation of the rights of a third party, including but not limited to intellectual property rights; (5) any overt harmful act toward any other user of the Service with whom you connected via the Service; or (6) any breach of, or failure to comply with, applicable law. Notwithstanding the foregoing, we reserve the right, at your expense, to assume the exclusive defense and control of any matter for which you are required to indemnify us, and you agree to cooperate, at your expense, with our defense of such claims. We will use reasonable efforts to notify you of any such claim, action, or proceeding which is subject to this indemnification upon becoming aware of it.MODIFYING AND TERMINATING OUR SERVICEWe reserve the right to modify our Service or to suspend or stop providing all or portions of our Service at any time. You also have the right to stop using our Service at any time. We are not responsible for any loss or harm related to your inability to access or use our Service.USER DATAWe will maintain certain data that you transmit to the Site for the purpose of managing the performance of the Site, as well as data relating to your use of the Site. Although we perform regular routine backups of data, you are solely responsible for all data that you transmit or that relates to any activity you have undertaken using the Site. You agree that we shall have no liability to you for any loss or corruption of any such data, and you hereby waive any right of action against us arising from any such loss or corruption of such data.ELECTRONIC COMMUNICATIONS, TRANSACTIONS, AND SIGNATURESYou agree and consent to receive disclosures and communications from us regarding our services (“Communications”), including, but not limited to:Terms and conditions of service, and amendments thereto;Privacy policies and notices, and amendments thereto;Client agreements and receipts;Legal and regulatory disclosures and communications; andCustomer service communications.We may provide Communications to you by email or by making them accessible on the Site or through email (including via “hyperlinks” provided online and in emails). We may always, in our sole discretion, provide you with any Communication via paper.Visiting the Site, sending us emails, and completing online forms constitute Communications. You consent to receive Communications, and you agree that all agreements, notices, disclosures, and other communications we provide to you electronically, via email and on the Site, satisfy any legal requirement that such communication be in writing. YOU HEREBY AGREE TO THE USE OF ELECTRONIC SIGNATURES, CONTRACTS, ORDERS, AND OTHER RECORDS, AND TO ELECTRONIC DELIVERY OF NOTICES, POLICIES, AND RECORDS OF TRANSACTIONS INITIATED OR COMPLETED BY US OR VIA THE SITE. You hereby waive any rights or requirements under any statutes, regulations, rules, ordinances, or other laws in any jurisdiction which require an original signature or delivery or retention of non-electronic records, or to payments or the granting of credits by any means other than electronic means.Withdrawal of ConsentYou may withdraw your consent to receive Communications under this EULA by contacting us at operations@solana.foundation. We will process your request to withdraw your consent to receive electronic Communications in a reasonable time. After we process your request, your access and use of the Service will terminate.Requesting Paper CopiesYou may request that we mail a paper copy of any electronic Communication by contacting us at operations@solana.foundation. We may charge you fees associated with processing and mailing your request. We will send a copy of the Communication to you within a reasonable timeframe.Termination and ChangesWe reserve the right, in our sole discretion, to discontinue the provision of your Communications, or to terminate or change the terms and conditions on which we provide Communications. We will provide you with notice of any such termination or change as required by law.CALIFORNIA USERS AND RESIDENTSIf any complaint with us is not satisfactorily resolved, you can contact the Complaint Assistance Unit of the Division of Consumer Services of the California Department of Consumer Affairs in writing at 1625 North Market Blvd., Suite N 112, Sacramento, California 95834 or by telephone at (800) 952-5210 or (916) 445-1254.MISCELLANEOUSThis EULA and any policies or operating rules posted by us on the Site or in respect to the Service constitute the entire agreement and understanding between you and us. Our failure to exercise or enforce any right or provision of this EULA shall not operate as a waiver of such right or provision. This EULA operates to the fullest extent permissible by law. We may assign any or all of our rights and obligations to others at any time. We shall not be responsible or liable for any loss, damage, delay, or failure to act caused by any cause beyond our reasonable control. If any provision or part of a provision of this EULA is determined to be unlawful, void, or unenforceable, that provision or part of the provision is deemed severable from this EULA and does not affect the validity and enforceability of any remaining provisions. There is no joint venture, partnership, employment or agency relationship created between you and us as a result of this EULA or use of the Service. You agree that this EULA will not be construed against us by virtue of having drafted them. You hereby waive any and all defenses you may have based on the electronic form of this EULA and the lack of signing by the parties hereto to execute this EULA.CONTACT USIn order to resolve a complaint regarding the Site or to receive further information regarding use of the Service, please contact us at: operations@solana.foundation.Managed by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 28789,
      "headings": [
        {
          "level": 1,
          "text": "Terms of Service"
        }
      ],
      "scraped_at": "2025-07-12 22:05:36"
    },
    "https://solana.com/privacy-policy": {
      "url": "https://solana.com/privacy-policy",
      "title": "Solana Privacy Policy | Solana",
      "description": "Solana Privacy Policy",
      "content": "Solana Privacy Policy | SolanaLearnDevelopersSolutionsNetworkCommunitySearchOptional EyebrowPowerful for developers. Fast for everyone.Last modified date: October 11, 2023This privacy policy (\"Privacy Policy\") explains how Solana Foundation (\"Solana,\" \"our,\" \"we,\" or \"us\") collects, uses, and discloses information about you. This Privacy Policy applies when you use www.solana.com (the \"Website\"), contact our customer service team, engage with us on social media, or otherwise interact with us.We may change this Privacy Policy from time to time. If we make changes, we will notify you by revising the date at the top of this policy and, in some cases, we may provide you with additional notice (such as adding a statement to our Website or sending you a notification). We encourage you to review this Privacy Policy regularly to stay informed about our information practices and the choices available to you.CONTENTSCollection of InformationUse of InformationSharing of InformationAnalyticsTransfer of Information to the United States and Other CountriesYour ChoicesYour California Privacy RightsAdditional Disclosures for Individuals in EuropeContact UsCOLLECTION OF INFORMATIONInformation You Provide to UsWe collect information you provide directly to us. For example, you share information directly with us when you fill out a form, make a purchase, communicate with us via third-party platforms, participate in a contest or promotion, request customer support, or otherwise communicate with us. The types of personal information we may collect include your name, email address, postal address, phone number, credit card and other payment information, and any other information you choose to provide.Information We Collect Automatically When You Interact with UsWhen you access or use our Website or otherwise transact business with us, we automatically collect certain information, including:Transactional Information:When you make a purchase or return, we collect information about the transaction, such as product details, purchase price, and the date and location of the transaction.Device and Usage Information:We collect information about how you access our Website, including data about the device and network you use, such as your hardware model, operating system version, mobile network, IP address, unique device identifiers, browser type, and app version. We also collect information about your activity on our Website, such as access times, pages viewed, links clicked, and the page you visited before navigating to our Website.Location Information:In accordance with your device permissions, we may collect information about the precise location of your device. You may stop the collection of precise location information at any time (see the Your Choices section below for details).Information Collected by Cookies and Similar Tracking Technologies:We (and our service providers) use tracking technologies, such as cookies and web beacons, to collect information about you. Cookies are small data files stored on your hard drive or in device memory that help us improve our Website and your experience, see which areas and features of our Website are popular, and count visits. Web beacons (also known as \"pixel tags\" or \"clear GIFs\") are electronic images that we use on our Website and in our emails to help deliver cookies, count visits, and understand usage and campaign effectiveness. For more information about cookies and how to disable them, the Your Choices section below.Information We Collect from Other SourcesWe obtain information from third-party sources. For example, we may collect information about you from identity verification services, data analytics providers, and mailing list providers (if applicable).USE OF INFORMATIONWe use the information we collect to:Provide, maintain, and improve our products and services;Process transactions and send you related information, including confirmations, receipts, invoices, customer experience surveys, and recall notices;Personalize and improve your experience on our Website;Send you technical notices, security alerts, and support and administrative messages;Respond to your comments and questions and provide customer service;Communicate with you about products, services, and events offered by Solana and others and provide news and information that we think will interest you (see the Your Choices section below for information about how to opt out of these communications at any time);Monitor and analyze trends, usage, and activities in connection with our Website;Facilitate contests, sweepstakes, and promotions and process and deliver entries and rewards;Detect, investigate, and prevent security incidents and other malicious, deceptive, fraudulent, or illegal activity and protect the rights and property of Solana and others;Debug to identify and repair errors in our Website;Comply with our legal and financial obligations; andCarry out any other purpose described to you at the time the information was collected.SHARING OF INFORMATIONWe share personal information in the following circumstances or as otherwise described in this policy:We share personal information with vendors, service providers, and consultants that need access to personal information in order to perform services for us, such as companies that assist us with web hosting, shipping and delivery, payment processing, fraud prevention, customer service, data analytics and marketing and advertising.We may disclose personal information if we believe that disclosure is in accordance with, or required by, any applicable law or legal process, including lawful requests by public authorities to meet national security or law enforcement requirements.We may share personal information if we believe that your actions are inconsistent with our user agreements or policies, if we believe that you have violated the law, or if we believe it is necessary to protect the rights, property, and safety of Solana, our users, the public, or others.We share personal information with our lawyers and other professional advisors where necessary to obtain advice or otherwise protect and manage our business interests.We may share personal information in connection with, or during negotiations concerning, any merger, sale of company assets, financing, or acquisition of all or a portion of our business by another company.We share personal information with your consent or at your direction.We also share aggregated or de-identified information that cannot reasonably be used to identify you.ANALYTICSWe allow others to provide analytics services on our behalf across the web and in mobile apps. These entities may use cookies, web beacons, device identifiers, and other technologies to collect information about your use of our Website and other websites and applications, including your IP address, web browser, mobile network information, pages viewed, time spent on pages or in mobile apps, links clicked, and conversion information. This information may be used by Solana and others to, among other things, research, analyze and track data, determine the popularity of certain content, and better understand your online activity. However, if you have deleted and disabled cookies, these uses will not be possible to the extent they are based on cookie information. We use Google Analytics to analyze traffic. You can find out more information about Google Analytics cookies by visiting the following location provided: https://developers.google.com/analytics/devguides/collection/analyticsjs/cookie-usage. To opt out of Google Analytics relating to your use of our site, you can download and install the Browser Plugin available by visiting the following location provided: https://tools.google.com/dlpage/gaoptout?hl=en.TRANSFER OF INFORMATION TO THE UNITED STATES AND OTHER COUNTRIESSolana operates and engages service providers in various jurisdictions. Therefore, we and our service providers may transfer your personal information to, or store or access it in, jurisdictions that may not provide levels of data protection that are equivalent to those of your home jurisdiction. By using our site, you acknowledge and agree to such transfers and processing, including to and in the United States. We will take steps to ensure that your personal information receives an adequate level of protection in the jurisdictions in which we process it.YOUR CHOICESCookiesMost browsers are set to accept cookies by default. If you prefer, you can usually set your browser to disable cookies, or to alert you when cookies are being sent. Likewise, most mobile devices allow you to disable the ability for geolocation information to be collected from your mobile device. The help function on most browsers and mobile devices contains instructions on how to set your browser to notify you before accepting cookies, disable cookies entirely, or disable the collection of geolocation data. You need to set each browser, on each device you use to surf the Web. Thus, if you use multiple browsers (e.g., Chrome, Safari, Internet Explorer, Firefox, etc.), you should repeat this procedure with each one. Similarly, if you connect to the Web from multiple devices (e.g., work and home), you need to set each browser on each device. Depending on your jurisdiction, you may be able to utilize additional cookie management tools. Please note that removing or rejecting cookies could affect the availability and functionality of our Website.Communications PreferencesYou may opt out of receiving newsletters from Solana by following the instructions in those communications.YOUR CALIFORNIA PRIVACY RIGHTSThe California Consumer Privacy Act or \"CCPA\" (Cal. Civ. Code § 1798.100 et seq.) affords consumers residing in California certain rights with respect to their personal information. If you are a California resident, this section applies to you.California Consumer Privacy ActIn the preceding 12 months, we have collected the following categories of personal information: identifiers, financial information, biometric information, internet or electric network activity information, and geolocation data. For details about the precise data points we collect and the categories of sources of such collection, please see the Collection of Information section above. We collect personal information for the business and commercial purposes described in the Use of Information section above. In the preceding 12 months, we have disclosed the following categories of personal information for business purposes to the following categories of recipients:Category of Personal InformationFinancial InformationCategories of RecipientsPayment providerThird-party logistics providersSolana does not sell your personal information.Subject to certain limitations, you have the right to (1) request to know more about the categories and specific pieces of personal information we collect, use, and disclose, (2) request deletion of your personal information, and (3) not be discriminated against for exercising these rights. You may make these requests by contacting us at operations@solana.com. We will verify your request by asking you to provide information related to your recent interactions with us. We will not discriminate against you if you exercise your rights under the CCPA.ADDITIONAL DISCLOSURES FOR INDIVIDUALS IN EUROPEIf you are located in the European Economic Area (\"EEA\"), the United Kingdom, or Switzerland, you have certain rights and protections under the law regarding the processing of your personal data, and this section applies to you.Legal Basis for ProcessingWhen we process your personal data, we will do so in reliance on the following lawful bases:To perform our responsibilities under our contract with you (e.g., processing payments for and providing the products and services you requested).When we have a legitimate interest in processing your personal data to operate our business or protect our interests (e.g., to provide, maintain, and improve our products and services, conduct data analytics, and communicate with you).To comply with our legal obligations (e.g., to maintain a record of your consents and track those who have opted out of communications).When we have your consent to do so (e.g., when you opt in to receive communications from us). When consent is the legal basis for our processing your personal data, you may withdraw such consent at any time.Data RetentionWe store other personal data for as long as necessary to carry out the purposes for which we originally collected it and for other legitimate business purposes, including to meet our legal, regulatory, or other compliance obligations.Data Subject RequestsSubject to certain limitations, you have the right to request access to the personal data we hold about you and to receive your data in a portable format, the right to ask that your personal data be corrected or erased, and the right to object to, or request that we restrict, certain processing. If you would like to exercise any of these rights, please contact us at operations@solana.com.Questions or ComplaintsIf you have a concern about our processing of personal data that we are not able to resolve, you have the right to lodge a complaint with the Data Protection Authority where you reside. Contact details for your Data Protection Authority can be found using the links below:For individuals in the EEA: https://edpb.europa.eu/about-edpb/board/members_enFor individuals in the UK: https://ico.org.uk/global/contact-us/For individuals in Switzerland: https://www.edoeb.admin.ch/edoeb/en/home/the-fdpic/contact.htmlCONTACT USIf you have any questions about this Privacy Policy, please contact us at operations@solana.com.Managed by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 13928,
      "headings": [
        {
          "level": 1,
          "text": "Powerful for developers. Fast for everyone."
        },
        {
          "level": 3,
          "text": "CONTENTS"
        },
        {
          "level": 3,
          "text": "COLLECTION OF INFORMATION"
        },
        {
          "level": 3,
          "text": "USE OF INFORMATION"
        },
        {
          "level": 3,
          "text": "SHARING OF INFORMATION"
        },
        {
          "level": 3,
          "text": "ANALYTICS"
        },
        {
          "level": 3,
          "text": "TRANSFER OF INFORMATION TO THE UNITED STATES AND OTHER COUNTRIES"
        },
        {
          "level": 3,
          "text": "YOUR CHOICES"
        },
        {
          "level": 3,
          "text": "YOUR CALIFORNIA PRIVACY RIGHTS"
        },
        {
          "level": 3,
          "text": "ADDITIONAL DISCLOSURES FOR INDIVIDUALS IN EUROPE"
        },
        {
          "level": 3,
          "text": "CONTACT US"
        }
      ],
      "scraped_at": "2025-07-12 22:05:37"
    },
    "https://solana.com/news": {
      "url": "https://solana.com/news",
      "title": "News | Solana",
      "description": "Read the latest updates, news, and information about the Solana ecosystem.",
      "content": "News | SolanaLearnDevelopersSolutionsNetworkCommunitySearchSolana News | Updates from the Solana ecosystemIntroducing Solana Attestation ServiceReadSee more +Announcing the Winners of the Solana Breakout HackathonMore than 10,000 participants submitted 1,412 final projects.Read ArticlePost Mortem: ZK ElGamal Proof Program Bug, June 2025Read ArticleSolana Network Health Report: June 2025Read ArticlePost Mortem: ZK ElGamal Proof Program BugRead ArticleGather to BuildLearn more about Solana Foundation events in 2025.Read ArticleSpend Your Magical Internet Money During the Onchain HolidayA Solana-powered gift store is up and running for all your onchain shopping needs.Read ArticleSolana Artists Embrace Digital Transformation at Art Basel Miami Beach‘Artists in Residence’ exhibition returns to Art Basel Miami Beach with three new digital artists.Read ArticleAnnouncing the Winners of the Solana Radar HackathonMore than 10,000 participants submitted 1,359 final projects.Read ArticleThe State of Solana at Breakpoint 2024Dig into the latest updates from the Solana ecosystem as of Breakpoint 2024.Read ArticleLoad MorePress roomSee the Solana ecosystem in the news.Solana Delivers 'Token Extensions' to Attract Compliance-Minded Token DevelopersReadSolana Pay integrates plug-in with Shopify for USDC paymentsReadVisa to send stablecoin USDC over Solana to help pay merchants in cryptoRead2024 will be 'a great year for crypto adoption,' Solana Foundation saysWatchSolana: The Past, Present, and FutureWatchSolana Foundation's head of policy discusses new energy use reportWatchManaged by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 1780,
      "headings": [
        {
          "level": 1,
          "text": "Introducing Solana Attestation Service"
        },
        {
          "level": 2,
          "text": "Announcing the Winners of the Solana Breakout Hackathon"
        },
        {
          "level": 2,
          "text": "Post Mortem: ZK ElGamal Proof Program Bug, June 2025"
        },
        {
          "level": 2,
          "text": "Solana Network Health Report: June 2025"
        },
        {
          "level": 2,
          "text": "Post Mortem: ZK ElGamal Proof Program Bug"
        },
        {
          "level": 2,
          "text": "Gather to Build"
        },
        {
          "level": 2,
          "text": "Spend Your Magical Internet Money During the Onchain Holiday"
        },
        {
          "level": 2,
          "text": "Solana Artists Embrace Digital Transformation at Art Basel Miami Beach"
        },
        {
          "level": 2,
          "text": "Announcing the Winners of the Solana Radar Hackathon"
        },
        {
          "level": 2,
          "text": "The State of Solana at Breakpoint 2024"
        },
        {
          "level": 2,
          "text": "Press room"
        },
        {
          "level": 3,
          "text": "Solana Delivers 'Token Extensions' to Attract Compliance-Minded Token Developers"
        },
        {
          "level": 3,
          "text": "Solana Pay integrates plug-in with Shopify for USDC payments"
        },
        {
          "level": 3,
          "text": "Visa to send stablecoin USDC over Solana to help pay merchants in crypto"
        },
        {
          "level": 3,
          "text": "2024 will be 'a great year for crypto adoption,' Solana Foundation says"
        },
        {
          "level": 3,
          "text": "Solana: The Past, Present, and Future"
        },
        {
          "level": 3,
          "text": "Solana Foundation's head of policy discusses new energy use report"
        }
      ],
      "scraped_at": "2025-07-12 22:05:39"
    },
    "https://solana.com/newsletter": {
      "url": "https://solana.com/newsletter",
      "title": "Newsletter | Solana",
      "description": "Fast. Decentralized. Scalable. Energy efficient. Solana can power thousands of transactions per second.",
      "content": "Newsletter | SolanaLearnDevelopersSolutionsNetworkCommunitySearchSign up to the Solana NewsletterWe promise we won’t spam you.Sign upManaged by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 328,
      "headings": [
        {
          "level": 3,
          "text": "Sign up to the Solana Newsletter"
        }
      ],
      "scraped_at": "2025-07-12 22:05:40"
    },
    "https://solana.com/learn/what-is-solana": {
      "url": "https://solana.com/learn/what-is-solana",
      "title": "What is Solana? | Solana",
      "description": "An introduction to Solana - a fast, low-cost network that enables new ways to transfer value, create applications, and interact online.",
      "content": "What is Solana? | SolanaLearnDevelopersSolutionsNetworkCommunitySearch1Current chapter: Chapter 1Solana BasicsNextChapters1.Chapter 1: What is Solana?2.Chapter 2: What is a Wallet?3.Chapter 3: Understanding Solana Transaction Fees4.Chapter 4: Sending and Receiving SOL5.Chapter 5: What is Staking?6.Chapter 6: Introduction to Solana Tokens7.Chapter 7: What are NFTs?8.Chapter 8: Introduction to DeFi on Solana9.Chapter 9: Exploring Solana Applications10.Chapter 10: Staying Safe on SolanaWhat is Solana?An introduction to Solana - a fast, low-cost network that enables new ways to transfer value, create applications, and interact online.What is Solana? Solana is a high-performance network that enables fast, secure, and affordable digital transactions. It powers thousands of applications ranging from payments and games to digital art and financial services. This chapter introduces the fundamentals of how Solana works and what makes it unique. Already Familiar with Crypto?If you already understand digital wallets and cryptocurrency basics, you can skip to the next chapter to begin setting up your Solana wallet.Skip to Chapter 2: What is a Wallet? What You'll Learn In this chapter, we'll cover: What Solana is and how it works Key features that make Solana unique What you can do on Solana Important concepts you'll encounter How to start your journey Understanding Solana Solana is a global network of computers working together to: Process transactions in less than a second Keep costs incredibly low (fractions of a penny) Run applications that anyone can use Maintain a shared record of all activity Think of Solana like the internet for value transfer and applications - always on, globally accessible, and open to everyone. What Makes Solana Different Speed While traditional bank transfers take days and credit cards take seconds to confirm (but days to settle), Solana transactions complete in under a second. This speed enables real-time experiences impossible elsewhere. Send money internationally as quickly as sending a text, or trade assets without waiting for confirmations. Cost Transaction fees on Solana typically cost $0.00025 - that's a quarter of a thousandth of a dollar. You could make 4,000 transactions for $1, making micropayments and frequent interactions practical. This enables new possibilities: tip creators a few cents, trade frequently without fees eating profits, or build apps where users interact often without cost concerns. Scale Solana can process thousands of transactions per second, comparable to major payment networks. This capacity means the network won't slow down or become expensive as more people use it. Your transaction processes just as quickly during peak times as quiet periods - essential for real-world adoption. Global Access Anyone with internet access can use Solana. No bank account, credit check, or geographic restrictions required. Your wallet works the same whether you're in New York, Nairobi, or anywhere else. A small business in a rural area gets the same tools as one in a major city - true equal access to digital financial services. What You Can Do on Solana Send Money Globally Transfer value to anyone, anywhere, instantly. Whether sending $5 or $50,000, the cost and speed remain the same. No choosing between expensive-fast or cheap-slow options. Just enter an address, confirm, and it's done. Trade Digital Assets Exchange between thousands of different tokens directly from your wallet. No account creation or waiting periods. Connect your wallet and start trading immediately with access to global markets 24/7. Collect Digital Art Buy, sell, and showcase NFTs - unique digital items ranging from art to music to virtual real estate. Support artists directly without gallery commissions. Your collection travels with you across platforms and can't be deleted by platform changes. Play Games Experience games where you truly own your items and can trade them with other players. That rare sword you found? It's yours to keep, sell, or use in other compatible games. Your time and skill can create real value. Earn Yield Participate in financial services that offer returns on your digital assets through lending and liquidity provision. Put idle assets to work earning interest or fees, with rates and risks transparent before you participate. Join Communities Access token-gated groups, vote on proposals, and participate in decentralized organizations. Your tokens become membership cards and voting rights. Influence project directions and coordinate with others who share your interests. Key Concepts SOL Solana's native currency, used to pay transaction fees and participate in network security. Think of it like stamps for sending mail - you need a small amount to use the network. Less than $1 worth of SOL covers hundreds of transactions. Wallets Software that stores your digital assets and lets you interact with applications. Your wallet is like a universal account that works across all Solana applications. One wallet gives you access to thousands of applications, with your assets and history traveling with you. Tokens Digital assets that can represent anything from currencies to ownership stakes in projects. Like apps on your phone, thousands of different tokens exist on Solana. Some maintain stable values for payments, others represent shares in projects or access to services. Validators Computers that process transactions and secure the network. Over 1,000 validators worldwide ensure Solana stays decentralized and reliable. Run by independent operators globally, this distributed structure prevents any single point of failure or control. Smart Contracts Programs that run on Solana, powering everything from simple transfers to complex applications. They execute exactly as programmed without possibility of downtime or interference. Like vending machines for digital services - predictable, automated, and available 24/7. How Solana Works (Simply) You initiate an action (like sending SOL) in your wallet Your transaction goes to validators who verify it's legitimate Validators reach consensus in less than a second Your transaction is confirmed and permanently recorded The recipient sees the result immediately This happens thousands of times per second across the global network. Complex technology works behind the scenes to make your experience instant and effortless. Getting Started Your Solana journey begins with three simple steps: Set up a wallet - Free software that takes minutes to install Get some SOL - A small amount to cover transaction fees Try your first transaction - Send SOL or interact with an app Each step builds your understanding and confidence. Start with basics and expand as you explore - there's no rush to do more than you're ready for. Why People Choose Solana For Individuals Financial access: Banking services without a bank True ownership: Control your digital assets directly Global participation: Access the same opportunities as anyone else Low barriers: Start with just a few dollars For Developers Performance: Build apps that feel instant Low costs: Users aren't priced out by fees Composability: Combine existing programs like Lego blocks Growing ecosystem: Vibrant community and resources For Businesses Efficiency: Reduce payment processing costs Innovation: Create new business models Global reach: Serve customers anywhere Future-ready: Build on cutting-edge technology Common Questions Is Solana secure? Yes. Solana uses advanced cryptography and is secured by over 1,000 validators worldwide. The network has processed billions of transactions since 2020. No single entity can alter transactions once confirmed. Your SOL is secured by your private keys, though some tokens may have freeze capabilities if configured by their creators. Do I need technical knowledge? No. Modern Solana applications are designed for everyday users. If you can use a smartphone app, you can use Solana. The complexity happens behind the scenes while you simply click buttons and confirm transactions. What if I make a mistake? Transactions on Solana are permanent, so it's important to double-check addresses. Start with small amounts while learning. Most wallets help prevent mistakes with address verification and transaction previews. How is this different from Bitcoin? While Bitcoin pioneered digital currency, Solana enables complex applications with much faster speeds and lower costs. Think of Bitcoin as digital gold and Solana as a platform for building applications. Bitcoin excels at being a store of value, while Solana optimizes for speed and functionality. Many people use both for different purposes. Your Journey Starts Here You're about to explore a new way of interacting online - one where you have direct control over your digital life. In the following chapters, you'll gain hands-on experience with: Setting up your first wallet Understanding fees and transactions Sending and receiving digital assets Exploring applications Staying safe and secure Each concept builds on the previous one, creating a complete understanding of how to use Solana effectively. Ready to begin? Let's set up your wallet in the next chapter.Next • Part 2: Wallet BasicsWhat is a Wallet?Chapters1.Chapter 1: What is Solana?Solana Basics2.Chapter 2: What is a Wallet?Wallet Basics3.Chapter 3: Understanding Solana Transaction FeesTransaction Fees4.Chapter 4: Sending and Receiving SOLTransfer SOL5.Chapter 5: What is Staking?Staking Rewards6.Chapter 6: Introduction to Solana TokensTokens7.Chapter 7: What are NFTs?NFT Basics8.Chapter 8: Introduction to DeFi on SolanaDeFi Intro9.Chapter 9: Exploring Solana ApplicationsApplications10.Chapter 10: Staying Safe on SolanaSecurity GuideManaged by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 9921,
      "headings": [
        {
          "level": 1,
          "text": "What is Solana?"
        },
        {
          "level": 1,
          "text": "What is Solana?"
        },
        {
          "level": 2,
          "text": "What You'll Learn"
        },
        {
          "level": 2,
          "text": "Understanding Solana"
        },
        {
          "level": 2,
          "text": "What Makes Solana Different"
        },
        {
          "level": 2,
          "text": "What You Can Do on Solana"
        },
        {
          "level": 2,
          "text": "Key Concepts"
        },
        {
          "level": 2,
          "text": "How Solana Works (Simply)"
        },
        {
          "level": 2,
          "text": "Getting Started"
        },
        {
          "level": 2,
          "text": "Why People Choose Solana"
        },
        {
          "level": 2,
          "text": "Common Questions"
        },
        {
          "level": 2,
          "text": "Your Journey Starts Here"
        },
        {
          "level": 2,
          "text": "Chapters"
        },
        {
          "level": 3,
          "text": "Already Familiar with Crypto?"
        },
        {
          "level": 3,
          "text": "Speed"
        },
        {
          "level": 3,
          "text": "Cost"
        },
        {
          "level": 3,
          "text": "Scale"
        },
        {
          "level": 3,
          "text": "Global Access"
        },
        {
          "level": 3,
          "text": "Send Money Globally"
        },
        {
          "level": 3,
          "text": "Trade Digital Assets"
        },
        {
          "level": 3,
          "text": "Collect Digital Art"
        },
        {
          "level": 3,
          "text": "Play Games"
        },
        {
          "level": 3,
          "text": "Earn Yield"
        },
        {
          "level": 3,
          "text": "Join Communities"
        },
        {
          "level": 3,
          "text": "SOL"
        },
        {
          "level": 3,
          "text": "Wallets"
        },
        {
          "level": 3,
          "text": "Tokens"
        },
        {
          "level": 3,
          "text": "Validators"
        },
        {
          "level": 3,
          "text": "Smart Contracts"
        },
        {
          "level": 3,
          "text": "For Individuals"
        },
        {
          "level": 3,
          "text": "For Developers"
        },
        {
          "level": 3,
          "text": "For Businesses"
        },
        {
          "level": 3,
          "text": "Is Solana secure?"
        },
        {
          "level": 3,
          "text": "Do I need technical knowledge?"
        },
        {
          "level": 3,
          "text": "What if I make a mistake?"
        },
        {
          "level": 3,
          "text": "How is this different from Bitcoin?"
        }
      ],
      "scraped_at": "2025-07-12 22:05:42"
    },
    "https://solana.com/learn/what-is-a-wallet": {
      "url": "https://solana.com/learn/what-is-a-wallet",
      "title": "What is a Wallet? | Solana",
      "description": "Learn what a Solana wallet is, how it works, and how to set one up safely. Your wallet is the tool you'll use to interact with Solana applications.",
      "content": "What is a Wallet? | SolanaLearnDevelopersSolutionsNetworkCommunitySearch2Current chapter: Chapter 2Wallet BasicsNextChapters1.Chapter 1: What is Solana?2.Chapter 2: What is a Wallet?3.Chapter 3: Understanding Solana Transaction Fees4.Chapter 4: Sending and Receiving SOL5.Chapter 5: What is Staking?6.Chapter 6: Introduction to Solana Tokens7.Chapter 7: What are NFTs?8.Chapter 8: Introduction to DeFi on Solana9.Chapter 9: Exploring Solana Applications10.Chapter 10: Staying Safe on SolanaWhat is a Wallet?Learn what a Solana wallet is, how it works, and how to set one up safely. Your wallet is the tool you'll use to interact with Solana applications.What is a Wallet? A wallet is your primary tool for using Solana. It stores your digital assets, lets you connect to applications, and enables you to send and receive tokens. This chapter will help you understand wallets and set up your first one safely. What You'll Learn By the end of this chapter, you'll understand: What wallets do and how they work Different types of wallets and their trade-offs How to create your first wallet Security best practices Common wallet features and uses Understanding Wallets A wallet serves several functions: Stores your keys: The cryptographic keys that prove you own your assets Holds your assets: Displays your tokens, NFTs, and other digital items Signs transactions: Approves actions on your behalf Connects to apps: Your login method for Solana applications Think of it as a combination of: A password manager (stores your keys) A bank account viewer (shows your balances) A digital signature tool (approves transactions) How Wallets Work Every wallet is built on cryptographic keys: Seed Phrase A series of 12-24 words that can recreate your wallet. This is your ultimate backup - keep it safe and private. Private Key Derived from your seed phrase, this key signs transactions. Your wallet manages this for you - you'll never need to see or handle it directly. Public Key/Address Derived from your private key, this is what you share to receive funds. It's safe to share publicly. Types of Wallets Software Wallets Browser Extensions Convenient for web applications Easy to use Good for daily transactions Free to use Mobile Apps Access your wallet anywhere QR code scanning for payments Biometric security (fingerprint/face) Free to use Desktop Applications Full-featured interfaces Good for active traders Advanced functionality Free to use Hardware Wallets Physical Devices Maximum security Offline key storage Best for large holdings Cost: $50-200 Choosing Your First Wallet For beginners, we recommend starting with a browser extension wallet. They're: User-friendly Well-supported Secure for everyday use Easy to set up Creating Your First Wallet Let's walk through the general process of setting up a wallet: Step 1: Choose and Install a Wallet Research popular Solana wallets Visit the official website (always verify URLs) Download the wallet for your platform Install following the official instructions Step 2: Create a New Wallet Open your wallet application Select \"Create a new wallet\" option Create a strong password for device access Important: Write down your seed phrase Step 3: Secure Your Seed Phrase Your seed phrase is critical. Here's how to store it safely: DO: Write it on paper Store in a secure location Consider multiple copies in different places Use a fireproof safe if possible DON'T: Screenshot it Store in email or cloud services Share with anyone Type it on random websites Step 4: Verify and Finish Confirm your seed phrase when prompted Your wallet is now ready to use You'll see your wallet address at the top Your initial balance will be 0 SOL Basic Wallet Features Modern wallets include: Asset Management View token balances Display NFT collections Track transaction history Monitor portfolio value Transaction Tools Send and receive tokens Swap between different tokens Connect to applications Approve or reject transactions Security Features Password protection Biometric authentication (mobile) Transaction warnings Phishing detection Your First Steps Now that you have a wallet, here's what to do next: Save your address: Copy it somewhere safe for reference Get some SOL: You'll need a small amount for transaction fees Practice receiving: Have a friend send you a tiny amount Explore the interface: Familiarize yourself with the layout Important Security Reminders Never share your seed phrase: No legitimate service will ask for it Verify websites: Scammers create fake wallet sites Start small: Use small amounts while learning Keep software updated: Install wallet updates promptly Be skeptical: If something seems too good to be true, it probably is Common Questions Do I need to pay for a wallet? Most software wallets are free. You only pay for hardware wallets or premium features. Can I have multiple wallets? Yes, many users have several wallets for different purposes (daily use, savings, specific applications). What if I forget my password? Your device password can be reset with your seed phrase. That's why the seed phrase is so important. Are my assets stored in the wallet? No, assets are stored on Solana. Your wallet stores the keys that prove ownership. What's Next With your wallet set up, you're ready to start using Solana. In the next chapter, we'll explore transaction fees and why they matter for accessibility. You'll learn why Solana's low fees enable use cases that aren't practical on other networks. Remember: everyone was new once. Take time to get comfortable with your wallet before moving large amounts. The Solana community is here to help if you have questions.Previous • Part 1: Solana BasicsWhat is Solana?Next • Part 3: Transaction FeesUnderstanding Solana Transaction FeesChapters1.Chapter 1: What is Solana?Solana Basics2.Chapter 2: What is a Wallet?Wallet Basics3.Chapter 3: Understanding Solana Transaction FeesTransaction Fees4.Chapter 4: Sending and Receiving SOLTransfer SOL5.Chapter 5: What is Staking?Staking Rewards6.Chapter 6: Introduction to Solana TokensTokens7.Chapter 7: What are NFTs?NFT Basics8.Chapter 8: Introduction to DeFi on SolanaDeFi Intro9.Chapter 9: Exploring Solana ApplicationsApplications10.Chapter 10: Staying Safe on SolanaSecurity GuideManaged by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 6448,
      "headings": [
        {
          "level": 1,
          "text": "What is a Wallet?"
        },
        {
          "level": 1,
          "text": "What is a Wallet?"
        },
        {
          "level": 2,
          "text": "What You'll Learn"
        },
        {
          "level": 2,
          "text": "Understanding Wallets"
        },
        {
          "level": 2,
          "text": "How Wallets Work"
        },
        {
          "level": 2,
          "text": "Types of Wallets"
        },
        {
          "level": 2,
          "text": "Creating Your First Wallet"
        },
        {
          "level": 2,
          "text": "Basic Wallet Features"
        },
        {
          "level": 2,
          "text": "Your First Steps"
        },
        {
          "level": 2,
          "text": "Important Security Reminders"
        },
        {
          "level": 2,
          "text": "Common Questions"
        },
        {
          "level": 2,
          "text": "What's Next"
        },
        {
          "level": 2,
          "text": "Chapters"
        },
        {
          "level": 3,
          "text": "Seed Phrase"
        },
        {
          "level": 3,
          "text": "Private Key"
        },
        {
          "level": 3,
          "text": "Public Key/Address"
        },
        {
          "level": 3,
          "text": "Software Wallets"
        },
        {
          "level": 3,
          "text": "Hardware Wallets"
        },
        {
          "level": 3,
          "text": "Choosing Your First Wallet"
        },
        {
          "level": 3,
          "text": "Step 1: Choose and Install a Wallet"
        },
        {
          "level": 3,
          "text": "Step 2: Create a New Wallet"
        },
        {
          "level": 3,
          "text": "Step 3: Secure Your Seed Phrase"
        },
        {
          "level": 3,
          "text": "Step 4: Verify and Finish"
        },
        {
          "level": 3,
          "text": "Asset Management"
        },
        {
          "level": 3,
          "text": "Transaction Tools"
        },
        {
          "level": 3,
          "text": "Security Features"
        },
        {
          "level": 3,
          "text": "Do I need to pay for a wallet?"
        },
        {
          "level": 3,
          "text": "Can I have multiple wallets?"
        },
        {
          "level": 3,
          "text": "What if I forget my password?"
        },
        {
          "level": 3,
          "text": "Are my assets stored in the wallet?"
        }
      ],
      "scraped_at": "2025-07-12 22:05:43"
    },
    "https://solana.com/learn/understanding-solana-transaction-fees": {
      "url": "https://solana.com/learn/understanding-solana-transaction-fees",
      "title": "Understanding Solana Transaction Fees | Solana",
      "description": "Learn how transaction fees work on Solana, why they're low, and what this means for different use cases.",
      "content": "Understanding Solana Transaction Fees | SolanaLearnDevelopersSolutionsNetworkCommunitySearch3Current chapter: Chapter 3Transaction FeesNextChapters1.Chapter 1: What is Solana?2.Chapter 2: What is a Wallet?3.Chapter 3: Understanding Solana Transaction Fees4.Chapter 4: Sending and Receiving SOL5.Chapter 5: What is Staking?6.Chapter 6: Introduction to Solana Tokens7.Chapter 7: What are NFTs?8.Chapter 8: Introduction to DeFi on Solana9.Chapter 9: Exploring Solana Applications10.Chapter 10: Staying Safe on SolanaUnderstanding Solana Transaction FeesLearn how transaction fees work on Solana, why they're low, and what this means for different use cases.Understanding Solana Transaction Fees Transaction fees are an important part of any digital network. On Solana, fees are designed to be predictable and affordable, typically costing fractions of a cent. This chapter explains how fees work and why they matter for accessibility. What You'll Learn In this chapter, we'll cover: Why networks need transaction fees How Solana's fee structure works Typical costs for different activities When and why fees might vary How low fees enable new use cases Why Transaction Fees Exist Transaction fees serve important purposes: Compensate validators: The computers that process transactions and secure the network Prevent spam: Even tiny fees discourage network abuse Prioritize transactions: Optional priority fees for time-sensitive needs On Solana, fees are kept minimal while still serving these functions. Solana's Fee Structure Base Fee Every transaction pays a base fee of 0.000005 SOL (5,000 lamports). At $100 per SOL, that's $0.0005 - half a tenth of a cent. Priority Fees During busy periods, you can add a small priority fee to process faster. These typically remain under $0.01 even during high demand. Storage Rent Creating new accounts (like token accounts) requires a small deposit (~0.002 SOL) that's refundable when the account is closed. Typical Transaction Costs Here are real examples of what you'll pay: ActionTypical CostIn USD (at $100/SOL)Send SOL0.000005 SOL$0.0005Send tokens0.000005 SOL$0.0005Swap tokens0.000005 SOL$0.0005Buy an NFT0.000005-0.001 SOL$0.0005-0.10Create token account~0.002 SOL$0.20 (refundable) For comparison, traditional systems charge: Wire transfer: $15-50 International transfer: $25-75 Stock trade: $5-10 How Solana Keeps Fees Low Solana achieves low fees through technical design: Parallel Processing Like a multi-lane highway, Solana processes many transactions simultaneously rather than one-by-one. Efficient Consensus Proof of History enables validators to agree quickly without extensive communication. Predictable Costs Unlike auction-based fees, Solana's fees remain stable regardless of network activity. What Low Fees Enable Micropayments Tip content creators $0.25 Pay-per-article at $0.10 In-game purchases under $1 Frequent Trading Make 100 trades for less than $0.10 total Rebalance portfolios without fee concerns Arbitrage small price differences profitably Global Remittances Send $10 to family without losing 30% to fees Weekly transfers become practical Any amount is worth sending Experimentation Try new applications without risk Learn by doing, not by reading Make mistakes without costly consequences Understanding Fee Markets During exceptional demand (like popular NFT launches), you might see: Normal Times Base fee only: 0.000005 SOL Instant confirmation No competition for block space Busy Periods Add priority fee: 0.0001-0.001 SOL Still under $0.10 total Faster processing for urgent needs How to Set Fees Most wallets handle this automatically, but you can: Use default settings for normal transactions Increase priority for time-sensitive actions Check network status if unsure Practical Examples Sarah - Online Seller Sells handmade jewelry for $15-30 per piece Credit card fees would take $0.75-1.50 (5%) Solana fees: $0.0005 (0.003%) Keeps 99.997% of every sale Miguel - Frequent Trader Makes 20 trades daily with $1,000 Traditional broker: $100-200 in fees Solana DEX: $0.10 total More profit from actual trading Ami - Sending Money Home Sends $50 weekly to family abroad Bank wire: $25 fee (50%) Money transfer service: $5 fee (10%) Solana: $0.0005 fee (0.001%) Managing Transaction Fees Best Practices Keep 0.1 SOL in your wallet for fees Use normal priority for most transactions Only increase priority when time-sensitive Close unused token accounts to reclaim rent Fee Estimation Wallets show estimated fees before confirming. Always review: Base transaction fee Any priority fee added Total cost in SOL and USD Common Questions Why do I need SOL for fees? All Solana transactions require SOL for fees, even when sending other tokens. Think of it like needing stamps to mail letters. Can fees suddenly spike? While priority fees can increase during high demand, they typically stay under $0.01. Base fees remain constant. What if I can't afford the fee? You'll need a small amount of SOL to pay for transaction fees. Most users purchase SOL from exchanges or receive it from friends to get started. Do failed transactions charge fees? Yes, because validators still process them. However, at $0.0005, this isn't financially significant. What's Next Now that you understand fees, you're ready to make your first transaction. In the next chapter, you'll practice sending and receiving SOL, experiencing these low fees firsthand. Remember: Solana's low fees aren't just about saving money - they're about making digital transactions accessible to everyone, enabling use cases that simply don't work with high fees.Previous • Part 2: Wallet BasicsWhat is a Wallet?Next • Part 4: Transfer SOLSending and Receiving SOLChapters1.Chapter 1: What is Solana?Solana Basics2.Chapter 2: What is a Wallet?Wallet Basics3.Chapter 3: Understanding Solana Transaction FeesTransaction Fees4.Chapter 4: Sending and Receiving SOLTransfer SOL5.Chapter 5: What is Staking?Staking Rewards6.Chapter 6: Introduction to Solana TokensTokens7.Chapter 7: What are NFTs?NFT Basics8.Chapter 8: Introduction to DeFi on SolanaDeFi Intro9.Chapter 9: Exploring Solana ApplicationsApplications10.Chapter 10: Staying Safe on SolanaSecurity GuideManaged by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 6385,
      "headings": [
        {
          "level": 1,
          "text": "Understanding Solana Transaction Fees"
        },
        {
          "level": 1,
          "text": "Understanding Solana Transaction Fees"
        },
        {
          "level": 2,
          "text": "What You'll Learn"
        },
        {
          "level": 2,
          "text": "Why Transaction Fees Exist"
        },
        {
          "level": 2,
          "text": "Solana's Fee Structure"
        },
        {
          "level": 2,
          "text": "Typical Transaction Costs"
        },
        {
          "level": 2,
          "text": "How Solana Keeps Fees Low"
        },
        {
          "level": 2,
          "text": "What Low Fees Enable"
        },
        {
          "level": 2,
          "text": "Understanding Fee Markets"
        },
        {
          "level": 2,
          "text": "Practical Examples"
        },
        {
          "level": 2,
          "text": "Managing Transaction Fees"
        },
        {
          "level": 2,
          "text": "Common Questions"
        },
        {
          "level": 2,
          "text": "What's Next"
        },
        {
          "level": 2,
          "text": "Chapters"
        },
        {
          "level": 3,
          "text": "Base Fee"
        },
        {
          "level": 3,
          "text": "Priority Fees"
        },
        {
          "level": 3,
          "text": "Storage Rent"
        },
        {
          "level": 3,
          "text": "Parallel Processing"
        },
        {
          "level": 3,
          "text": "Efficient Consensus"
        },
        {
          "level": 3,
          "text": "Predictable Costs"
        },
        {
          "level": 3,
          "text": "Micropayments"
        },
        {
          "level": 3,
          "text": "Frequent Trading"
        },
        {
          "level": 3,
          "text": "Global Remittances"
        },
        {
          "level": 3,
          "text": "Experimentation"
        },
        {
          "level": 3,
          "text": "Normal Times"
        },
        {
          "level": 3,
          "text": "Busy Periods"
        },
        {
          "level": 3,
          "text": "How to Set Fees"
        },
        {
          "level": 3,
          "text": "Sarah - Online Seller"
        },
        {
          "level": 3,
          "text": "Miguel - Frequent Trader"
        },
        {
          "level": 3,
          "text": "Ami - Sending Money Home"
        },
        {
          "level": 3,
          "text": "Best Practices"
        },
        {
          "level": 3,
          "text": "Fee Estimation"
        },
        {
          "level": 3,
          "text": "Why do I need SOL for fees?"
        },
        {
          "level": 3,
          "text": "Can fees suddenly spike?"
        },
        {
          "level": 3,
          "text": "What if I can't afford the fee?"
        },
        {
          "level": 3,
          "text": "Do failed transactions charge fees?"
        }
      ],
      "scraped_at": "2025-07-12 22:05:44"
    },
    "https://solana.com/learn/sending-and-receiving-sol": {
      "url": "https://solana.com/learn/sending-and-receiving-sol",
      "title": "Sending and Receiving SOL | Solana",
      "description": "Learn how to send and receive SOL tokens - the fundamental skill for interacting with the Solana network and its applications.",
      "content": "Sending and Receiving SOL | SolanaLearnDevelopersSolutionsNetworkCommunitySearch4Current chapter: Chapter 4Transfer SOLNextChapters1.Chapter 1: What is Solana?2.Chapter 2: What is a Wallet?3.Chapter 3: Understanding Solana Transaction Fees4.Chapter 4: Sending and Receiving SOL5.Chapter 5: What is Staking?6.Chapter 6: Introduction to Solana Tokens7.Chapter 7: What are NFTs?8.Chapter 8: Introduction to DeFi on Solana9.Chapter 9: Exploring Solana Applications10.Chapter 10: Staying Safe on SolanaSending and Receiving SOLLearn how to send and receive SOL tokens - the fundamental skill for interacting with the Solana network and its applications.Sending and Receiving SOL Being able to send and receive SOL is your first practical skill on Solana. SOL is the native token of the Solana network, used for transactions, staking, and interacting with applications. In this chapter, you'll learn how transfers work and practice making your first transaction. What You'll Learn By the end of this chapter, you'll be able to: Understand your wallet address and how to share it safely Send SOL to another wallet Receive SOL from others Check transaction status Understand what happens during a transfer Understanding Your Wallet Address Your wallet address is like your account number on Solana. It's: Public: Safe to share when receiving funds Unique: No two wallets have the same address Permanent: Doesn't change or expire Example address: 7xKXtg2CW87d8V6zXKBq7cM8Y2FPHwzaAkxqEqD7x4rH Sharing Your Address You can share your address through: Copy/Paste: Click the copy button in your wallet QR Code: Let others scan it with their phone ENS/Domain Names: Human-readable names (like yourname.sol) Receiving SOL Receiving SOL is straightforward: Open your wallet Find your address (usually displayed at the top) Share it with the sender Wait a few seconds for the transaction to complete See your new balance update automatically What Senders Need When someone sends you SOL, they only need: Your wallet address The amount to send They don't need your name, location, or any personal information. Sending SOL Here's how to send SOL to someone else: Step 1: Get the Recipient's Address Ask them to share their Solana wallet address Double-check you have the correct address Remember: transactions cannot be reversed Step 2: Initiate the Transfer Click \"Send\" in your wallet Paste the recipient's address Enter the amount of SOL Review the transaction fee (usually < $0.001) Step 3: Confirm and Send Review all details carefully Confirm the transaction Wait 1-2 seconds for completion Save the transaction ID for your records Understanding Transaction Details Every transaction creates a record containing: Signature: Unique transaction identifier From/To: Sender and recipient addresses Amount: How much SOL was transferred Fee: Network fee paid (in SOL) Timestamp: When it occurred Status: Success or failure You can view any transaction on a block explorer like Solscan or Solana Explorer. Common Questions How long do transfers take? Typically 1-2 seconds. Solana processes transactions very quickly compared to traditional banking. What if I send to the wrong address? Transactions are permanent and cannot be reversed. Always double-check addresses before sending. Why do I need SOL for fees? Every transaction requires a small fee (usually $0.00025) to compensate the network validators who process it. Can I send other tokens besides SOL? Yes, but you'll always need a small amount of SOL for transaction fees, even when sending other tokens. Practice Exercise Ready to try your first transaction? Here's a safe way to practice: Send a tiny amount (like 0.001 SOL) to a friend Have them send it back to you Look up the transaction on a block explorer Note the fee and confirmation time This helps you get comfortable with the process using minimal amounts. Transaction Best Practices Start small when sending to a new address Save important addresses in your wallet's address book Keep transaction records for tax or personal tracking Double-check addresses - especially the first and last 4 characters Be aware of the current SOL price when sending What's Next Now that you can send and receive SOL, you're ready to explore more advanced features. In the next chapter, we'll learn about staking - a way to earn rewards by helping secure the Solana network. Remember: every expert was once a beginner. Take your time, start with small amounts, and build confidence through practice.Previous • Part 3: Transaction FeesUnderstanding Solana Transaction FeesNext • Part 5: Staking RewardsWhat is Staking?Chapters1.Chapter 1: What is Solana?Solana Basics2.Chapter 2: What is a Wallet?Wallet Basics3.Chapter 3: Understanding Solana Transaction FeesTransaction Fees4.Chapter 4: Sending and Receiving SOLTransfer SOL5.Chapter 5: What is Staking?Staking Rewards6.Chapter 6: Introduction to Solana TokensTokens7.Chapter 7: What are NFTs?NFT Basics8.Chapter 8: Introduction to DeFi on SolanaDeFi Intro9.Chapter 9: Exploring Solana ApplicationsApplications10.Chapter 10: Staying Safe on SolanaSecurity GuideManaged by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 5291,
      "headings": [
        {
          "level": 1,
          "text": "Sending and Receiving SOL"
        },
        {
          "level": 1,
          "text": "Sending and Receiving SOL"
        },
        {
          "level": 2,
          "text": "What You'll Learn"
        },
        {
          "level": 2,
          "text": "Understanding Your Wallet Address"
        },
        {
          "level": 2,
          "text": "Receiving SOL"
        },
        {
          "level": 2,
          "text": "Sending SOL"
        },
        {
          "level": 2,
          "text": "Understanding Transaction Details"
        },
        {
          "level": 2,
          "text": "Common Questions"
        },
        {
          "level": 2,
          "text": "Practice Exercise"
        },
        {
          "level": 2,
          "text": "Transaction Best Practices"
        },
        {
          "level": 2,
          "text": "What's Next"
        },
        {
          "level": 2,
          "text": "Chapters"
        },
        {
          "level": 3,
          "text": "Sharing Your Address"
        },
        {
          "level": 3,
          "text": "What Senders Need"
        },
        {
          "level": 3,
          "text": "Step 1: Get the Recipient's Address"
        },
        {
          "level": 3,
          "text": "Step 2: Initiate the Transfer"
        },
        {
          "level": 3,
          "text": "Step 3: Confirm and Send"
        },
        {
          "level": 3,
          "text": "How long do transfers take?"
        },
        {
          "level": 3,
          "text": "What if I send to the wrong address?"
        },
        {
          "level": 3,
          "text": "Why do I need SOL for fees?"
        },
        {
          "level": 3,
          "text": "Can I send other tokens besides SOL?"
        }
      ],
      "scraped_at": "2025-07-12 22:05:47"
    },
    "https://solana.com/learn/what-is-staking": {
      "url": "https://solana.com/learn/what-is-staking",
      "title": "What is Staking? | Solana",
      "description": "Learn how staking works on Solana, how to earn rewards by helping secure the network, and what to consider when choosing validators.",
      "content": "What is Staking? | SolanaLearnDevelopersSolutionsNetworkCommunitySearch5Current chapter: Chapter 5Staking RewardsNextChapters1.Chapter 1: What is Solana?2.Chapter 2: What is a Wallet?3.Chapter 3: Understanding Solana Transaction Fees4.Chapter 4: Sending and Receiving SOL5.Chapter 5: What is Staking?6.Chapter 6: Introduction to Solana Tokens7.Chapter 7: What are NFTs?8.Chapter 8: Introduction to DeFi on Solana9.Chapter 9: Exploring Solana Applications10.Chapter 10: Staying Safe on SolanaWhat is Staking?Learn how staking works on Solana, how to earn rewards by helping secure the network, and what to consider when choosing validators.What is Staking? Staking is how you can earn rewards by helping secure the Solana network. When you stake your SOL, you're contributing to the network's security while earning approximately 5-7% annual rewards. This chapter explains how staking works and how to get started. What You'll Learn By the end of this chapter, you'll understand: How staking helps secure the network How to stake your SOL and earn rewards How to choose validators Different staking options available Risks and considerations How Staking Works Staking on Solana uses a system called Proof of Stake: You delegate SOL to a validator of your choice Validators process transactions and secure the network The network creates new SOL as rewards You earn a share of these rewards Your SOL never leaves your wallet - you're simply giving a validator permission to use it as part of their stake. Why Networks Need Staking Staking serves important purposes: Network Security Validators must stake SOL as collateral. If they misbehave, they risk losing their stake. This economic incentive keeps validators honest. Decentralization Having many validators worldwide makes the network resilient. No single entity controls transaction processing. Sustainable Rewards Unlike mining, staking doesn't require expensive hardware or high energy consumption. Rewards come from network inflation designed to secure the network long-term. Getting Started with Staking Step 1: Choose Your Method Native Staking (Recommended for beginners) Stake directly from your wallet Full control over your SOL 2-3 day unstaking period Earn 5-7% APY Liquid Staking Receive tokens representing your staked SOL Use these tokens in other applications Instant liquidity Slightly lower rewards due to fees Step 2: Select a Validator Consider these factors when choosing: Uptime: How reliably they stay online (aim for 95%+) Commission: Fee they charge (typically 5-10%) Size: Supporting smaller validators helps decentralization Performance: How many rewards they've earned historically Step 3: Delegate Your SOL Open your wallet's staking section Choose your validator Enter the amount to stake Confirm the transaction Your SOL remains in your control throughout this process. Understanding Rewards How Rewards Work Current rate: ~5-7% annually Paid every epoch (~2-3 days) Automatically compounded if left staked Rewards come from network inflation Example Calculation If you stake 1,000 SOL at 6% APY: Annual rewards: ~60 SOL Monthly rewards: ~5 SOL Per epoch: ~0.5 SOL Managing Your Stake Adding More SOL You can add to your stake anytime. New SOL starts earning immediately. Unstaking Process Request unstaking in your wallet Wait 2-3 days (cooldown period) Withdraw your SOL This delay protects network stability but means you can't access funds immediately. Switching Validators You can redelegate to a different validator without unstaking. This helps if your validator's performance declines. Liquid Staking Options Liquid staking protocols offer flexibility: How It Works Deposit SOL into the protocol Receive liquid staking tokens (like mSOL or stSOL) Use these tokens while still earning staking rewards Exchange back for SOL plus rewards anytime Trade-offs Pros: Immediate liquidity Use staked value in DeFi No unstaking period Cons: Small protocol fees Additional smart contract risk Slightly lower yields Important Considerations Risks Validator performance: Poor validators mean fewer rewards Opportunity cost: Your SOL is locked during unstaking No slashing currently: Unlike some networks, Solana doesn't currently penalize validators by taking their stake Tax Implications Staking rewards may be taxable income in your jurisdiction. Keep records and consult tax professionals. Best Practices Start with a small amount to learn Diversify across multiple validators Monitor validator performance periodically Consider liquid staking for flexibility Common Questions Is staking safe? Your SOL never leaves your wallet. The main risk is choosing a poor-performing validator, which affects rewards but not your principal. Can I lose my staked SOL? Currently, Solana doesn't have slashing (penalty for validator misbehavior). Your main risk is missing rewards from poor validator performance. How often are rewards paid? Rewards accumulate every epoch (approximately 2-3 days) and are automatically compounded. What's the minimum to stake? There's no network minimum, but some wallets may have small minimums (often 1 SOL or less). What's Next Now that you understand staking, you're ready to learn about tokens on Solana. The next chapter explores how different types of tokens work and what you can do with them. Remember: staking is a long-term strategy for earning rewards while supporting network security. Start small, choose validators carefully, and let compound interest work for you.Previous • Part 4: Transfer SOLSending and Receiving SOLNext • Part 6: TokensIntroduction to Solana TokensChapters1.Chapter 1: What is Solana?Solana Basics2.Chapter 2: What is a Wallet?Wallet Basics3.Chapter 3: Understanding Solana Transaction FeesTransaction Fees4.Chapter 4: Sending and Receiving SOLTransfer SOL5.Chapter 5: What is Staking?Staking Rewards6.Chapter 6: Introduction to Solana TokensTokens7.Chapter 7: What are NFTs?NFT Basics8.Chapter 8: Introduction to DeFi on SolanaDeFi Intro9.Chapter 9: Exploring Solana ApplicationsApplications10.Chapter 10: Staying Safe on SolanaSecurity GuideManaged by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 6277,
      "headings": [
        {
          "level": 1,
          "text": "What is Staking?"
        },
        {
          "level": 1,
          "text": "What is Staking?"
        },
        {
          "level": 2,
          "text": "What You'll Learn"
        },
        {
          "level": 2,
          "text": "How Staking Works"
        },
        {
          "level": 2,
          "text": "Why Networks Need Staking"
        },
        {
          "level": 2,
          "text": "Getting Started with Staking"
        },
        {
          "level": 2,
          "text": "Understanding Rewards"
        },
        {
          "level": 2,
          "text": "Managing Your Stake"
        },
        {
          "level": 2,
          "text": "Liquid Staking Options"
        },
        {
          "level": 2,
          "text": "Important Considerations"
        },
        {
          "level": 2,
          "text": "Common Questions"
        },
        {
          "level": 2,
          "text": "What's Next"
        },
        {
          "level": 2,
          "text": "Chapters"
        },
        {
          "level": 3,
          "text": "Network Security"
        },
        {
          "level": 3,
          "text": "Decentralization"
        },
        {
          "level": 3,
          "text": "Sustainable Rewards"
        },
        {
          "level": 3,
          "text": "Step 1: Choose Your Method"
        },
        {
          "level": 3,
          "text": "Step 2: Select a Validator"
        },
        {
          "level": 3,
          "text": "Step 3: Delegate Your SOL"
        },
        {
          "level": 3,
          "text": "How Rewards Work"
        },
        {
          "level": 3,
          "text": "Example Calculation"
        },
        {
          "level": 3,
          "text": "Adding More SOL"
        },
        {
          "level": 3,
          "text": "Unstaking Process"
        },
        {
          "level": 3,
          "text": "Switching Validators"
        },
        {
          "level": 3,
          "text": "How It Works"
        },
        {
          "level": 3,
          "text": "Trade-offs"
        },
        {
          "level": 3,
          "text": "Risks"
        },
        {
          "level": 3,
          "text": "Tax Implications"
        },
        {
          "level": 3,
          "text": "Best Practices"
        },
        {
          "level": 3,
          "text": "Is staking safe?"
        },
        {
          "level": 3,
          "text": "Can I lose my staked SOL?"
        },
        {
          "level": 3,
          "text": "How often are rewards paid?"
        },
        {
          "level": 3,
          "text": "What's the minimum to stake?"
        }
      ],
      "scraped_at": "2025-07-12 22:05:49"
    },
    "https://solana.com/learn/introduction-to-solana-tokens": {
      "url": "https://solana.com/learn/introduction-to-solana-tokens",
      "title": "Introduction to Solana Tokens | Solana",
      "description": "Learn about tokens - the different types of digital assets on Solana including stablecoins, wrapped tokens, and project tokens.",
      "content": "Introduction to Solana Tokens | SolanaLearnDevelopersSolutionsNetworkCommunitySearch6Current chapter: Chapter 6TokensNextChapters1.Chapter 1: What is Solana?2.Chapter 2: What is a Wallet?3.Chapter 3: Understanding Solana Transaction Fees4.Chapter 4: Sending and Receiving SOL5.Chapter 5: What is Staking?6.Chapter 6: Introduction to Solana Tokens7.Chapter 7: What are NFTs?8.Chapter 8: Introduction to DeFi on Solana9.Chapter 9: Exploring Solana Applications10.Chapter 10: Staying Safe on SolanaIntroduction to Solana TokensLearn about tokens - the different types of digital assets on Solana including stablecoins, wrapped tokens, and project tokens.Introduction to Solana Tokens Tokens are digital assets built on Solana. Like how the US dollar is the native currency of the United States, SOL is Solana's native currency. Tokens represent all other assets - from stablecoins like USDC to project tokens and NFTs. This chapter explains how tokens work and what you can do with them. What You'll Learn By the end of this chapter, you'll understand: What tokens are and how they work on Solana Different types of tokens and their uses How to manage tokens in your wallet Token accounts and fees Safety considerations when dealing with tokens Understanding Tokens on Solana Solana has two main types of digital assets: SOL: The native currency used for transactions and fees Tokens: All other digital assets on Solana Just like apps on your phone follow certain standards to work properly, tokens on Solana follow a common standard that makes them compatible with wallets and applications. Types of Tokens Stablecoins Digital versions of traditional currencies that maintain stable value. Examples: USDC: Digital US dollars USDT: Tether, another USD stablecoin EURC: Digital euros Uses: Saving, payments, trading, avoiding volatility Wrapped Assets Tokens representing assets from other networks. Examples: Wrapped Bitcoin (BTC): Bitcoin usable on Solana Wrapped Ethereum (ETH): Ethereum on Solana Wrapped SOL: Used in some DeFi protocols Uses: Access other cryptocurrencies with Solana's speed and low fees Project Tokens Tokens created by applications and protocols. Examples: Governance tokens for voting on protocol decisions Exchange tokens offering fee discounts Protocol tokens for ecosystem participation Uses: Governance voting, fee discounts, rewards Utility Tokens Tokens with specific functions within applications. Examples: Gaming tokens for in-game economies Social tokens for creator communities Reward tokens from protocols Uses: Access features, earn rewards, participate in ecosystems How Token Accounts Work Unlike some networks where all assets share one address, Solana uses a token account system: Main Wallet: Holds your SOL Token Accounts: Separate accounts for each token type Why Token Accounts? Better performance and organization Clear separation of different assets Efficient network storage Account Rent Each token account requires ~0.002 SOL deposit This \"rent\" is refundable when closing the account Prevents spam and funds network storage Typically costs $0.20-0.50 per token type Managing Your Tokens Receiving Tokens Share your wallet address Sender initiates transfer Wallet creates token account if needed Tokens appear in your wallet Viewing Your Tokens Modern wallets show: Token symbols and logos Current balances USD values Recent transactions Sending Tokens Select token to send Enter recipient address Choose amount Confirm transaction Pay small SOL fee (~$0.0005) Closing Token Accounts When you no longer need a token: Send all tokens out Close the account Recover the rent deposit Token Creation Basics Anyone can create tokens on Solana: Requirements Small amount of SOL for fees (~0.5 SOL) Basic token information (name, symbol, supply) Optional: logo and metadata Common Uses Community tokens Reward systems Fundraising Gaming economies Experimental projects Important Note Creating a token doesn't give it value. Value comes from utility, adoption, and market dynamics. Token Safety Verify Before Trusting Check official project websites Verify token addresses Look for audit reports Research the team Common Scams to Avoid Fake tokens: Impersonating popular projects Rug pulls: Creators abandoning projects Honeypots: Tokens you can buy but not sell Pump and dumps: Artificial price manipulation Best Practices Research thoroughly before buying Start small with new tokens Use reputable sources for token information Be skeptical of guaranteed returns Check liquidity before large purchases Working with Tokens Swapping Tokens Use DEX aggregators to find the best rates: Connect wallet Select tokens to swap Review rate and fees Confirm swap Checking Token Info Resources for research: Block explorers: View token details and holders Price aggregators: Check prices and liquidity Official project sites: Verify authenticity Managing Multiple Tokens Organize by hiding zero balances Favorite frequently used tokens Use portfolio trackers Close unused token accounts Common Questions Do I need SOL to send tokens? Yes, all transactions require small SOL fees, even when sending other tokens. Why do some tokens appear automatically? Projects can airdrop tokens to wallets. Be cautious of unsolicited tokens. Can I recover sent tokens? No, transactions on Solana are permanent. Always double-check addresses. What determines token value? Supply and demand, utility, project development, and market sentiment all affect token prices. What's Next Now that you understand tokens, you're ready to learn about NFTs - unique digital assets that represent ownership of specific items rather than fungible currencies. The next chapter explores how NFTs work and their various use cases. Remember: tokens are tools that enable new types of digital economies. Focus on understanding their utility rather than speculation, and always research before investing.Previous • Part 5: Staking RewardsWhat is Staking?Next • Part 7: NFT BasicsWhat are NFTs?Chapters1.Chapter 1: What is Solana?Solana Basics2.Chapter 2: What is a Wallet?Wallet Basics3.Chapter 3: Understanding Solana Transaction FeesTransaction Fees4.Chapter 4: Sending and Receiving SOLTransfer SOL5.Chapter 5: What is Staking?Staking Rewards6.Chapter 6: Introduction to Solana TokensTokens7.Chapter 7: What are NFTs?NFT Basics8.Chapter 8: Introduction to DeFi on SolanaDeFi Intro9.Chapter 9: Exploring Solana ApplicationsApplications10.Chapter 10: Staying Safe on SolanaSecurity GuideManaged by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 6676,
      "headings": [
        {
          "level": 1,
          "text": "Introduction to Solana Tokens"
        },
        {
          "level": 1,
          "text": "Introduction to Solana Tokens"
        },
        {
          "level": 2,
          "text": "What You'll Learn"
        },
        {
          "level": 2,
          "text": "Understanding Tokens on Solana"
        },
        {
          "level": 2,
          "text": "Types of Tokens"
        },
        {
          "level": 2,
          "text": "How Token Accounts Work"
        },
        {
          "level": 2,
          "text": "Managing Your Tokens"
        },
        {
          "level": 2,
          "text": "Token Creation Basics"
        },
        {
          "level": 2,
          "text": "Token Safety"
        },
        {
          "level": 2,
          "text": "Working with Tokens"
        },
        {
          "level": 2,
          "text": "Common Questions"
        },
        {
          "level": 2,
          "text": "What's Next"
        },
        {
          "level": 2,
          "text": "Chapters"
        },
        {
          "level": 3,
          "text": "Stablecoins"
        },
        {
          "level": 3,
          "text": "Wrapped Assets"
        },
        {
          "level": 3,
          "text": "Project Tokens"
        },
        {
          "level": 3,
          "text": "Utility Tokens"
        },
        {
          "level": 3,
          "text": "Why Token Accounts?"
        },
        {
          "level": 3,
          "text": "Account Rent"
        },
        {
          "level": 3,
          "text": "Receiving Tokens"
        },
        {
          "level": 3,
          "text": "Viewing Your Tokens"
        },
        {
          "level": 3,
          "text": "Sending Tokens"
        },
        {
          "level": 3,
          "text": "Closing Token Accounts"
        },
        {
          "level": 3,
          "text": "Requirements"
        },
        {
          "level": 3,
          "text": "Common Uses"
        },
        {
          "level": 3,
          "text": "Important Note"
        },
        {
          "level": 3,
          "text": "Verify Before Trusting"
        },
        {
          "level": 3,
          "text": "Common Scams to Avoid"
        },
        {
          "level": 3,
          "text": "Best Practices"
        },
        {
          "level": 3,
          "text": "Swapping Tokens"
        },
        {
          "level": 3,
          "text": "Checking Token Info"
        },
        {
          "level": 3,
          "text": "Managing Multiple Tokens"
        },
        {
          "level": 3,
          "text": "Do I need SOL to send tokens?"
        },
        {
          "level": 3,
          "text": "Why do some tokens appear automatically?"
        },
        {
          "level": 3,
          "text": "Can I recover sent tokens?"
        },
        {
          "level": 3,
          "text": "What determines token value?"
        }
      ],
      "scraped_at": "2025-07-12 22:05:52"
    },
    "https://solana.com/learn/what-are-nfts": {
      "url": "https://solana.com/learn/what-are-nfts",
      "title": "What are NFTs? | Solana",
      "description": "Learn about Non-Fungible Tokens (NFTs) on Solana - unique digital assets that represent ownership of specific items like art, collectibles, and more.",
      "content": "What are NFTs? | SolanaLearnDevelopersSolutionsNetworkCommunitySearch7Current chapter: Chapter 7NFT BasicsNextChapters1.Chapter 1: What is Solana?2.Chapter 2: What is a Wallet?3.Chapter 3: Understanding Solana Transaction Fees4.Chapter 4: Sending and Receiving SOL5.Chapter 5: What is Staking?6.Chapter 6: Introduction to Solana Tokens7.Chapter 7: What are NFTs?8.Chapter 8: Introduction to DeFi on Solana9.Chapter 9: Exploring Solana Applications10.Chapter 10: Staying Safe on SolanaWhat are NFTs?Learn about Non-Fungible Tokens (NFTs) on Solana - unique digital assets that represent ownership of specific items like art, collectibles, and more.What are NFTs? NFTs (Non-Fungible Tokens) are unique digital assets that represent ownership of specific items. Unlike regular tokens where each unit is identical and interchangeable, each NFT is one-of-a-kind. This chapter explains how NFTs work on Solana and their various uses beyond digital art. What You'll Learn By the end of this chapter, you'll understand: What makes NFTs different from regular tokens Common uses for NFTs today How NFTs work technically on Solana The process of creating NFTs Storage and management basics Understanding Non-Fungible The key difference: Fungible (Regular Tokens) Each unit is identical Interchangeable Like currency or shares Example: 1 USDC = any other 1 USDC Non-Fungible (NFTs) Each one is unique Not interchangeable Like collectibles or property Example: Each piece of art is different Common NFT Use Cases Digital Art and Collectibles Artists create unique or limited edition digital artwork. Direct artist-to-collector sales Royalties on secondary sales Verifiable authenticity Global marketplace access Gaming Assets In-game items with real ownership. Trade items between players Use across compatible games Retain value outside the game True digital property rights Music and Media Musicians and creators tokenize their work. Direct fan support Royalty distribution Exclusive content access New monetization models Event Tickets Digital tickets that prevent fraud. Verifiable authenticity Built-in resale controls Collectible after events Direct from organizers Memberships and Access Token-gated communities and services. Transferable memberships Tiered access levels Community governance Exclusive benefits How NFTs Work on Solana Technical Structure Metadata: Information about the NFT (name, image, traits) Mint Account: Unique identifier on Solana Token Account: Shows current owner Associated Files: Usually stored off-chain (IPFS, Arweave) Why Solana for NFTs? Low Costs: Mint for ~$0.50 compared to much higher costs elsewhere Fast Transactions: Instant transfers and purchases Compressed NFTs: Even cheaper for large collections Active Ecosystem: Vibrant marketplaces and communities NFT Costs on Solana Typical Fees Minting: ~0.01 SOL ($0.50-1.00) Buying: Marketplace fee (2-3%) + network fee Listing: Usually free Transferring: ~0.000005 SOL ($0.0005) Compressed NFTs For large-scale use cases: 1000x cheaper than regular NFTs Perfect for gaming items Same ownership benefits Slightly different technical structure Storing and Managing NFTs Wallet Display Most Solana wallets automatically: Show your NFT collection Display images and metadata Organize by collection Enable easy transfers Best Practices Use trusted wallets Verify authenticity (check official sources) Be cautious of DMs (avoid impersonators) Consider hardware wallets for important collections Understand ownership rights (owning an NFT ≠ copyright) Creating NFTs Basic Process Create or obtain digital content Upload to storage (IPFS/Arweave) Create metadata file Mint on Solana List on marketplaces Platforms for Creators Technical standards for NFT creation Creator-friendly minting tools Art-focused marketplace platforms Common Questions Do I own the copyright? Usually no. NFT ownership typically means you own that specific token, not copyright to the underlying art. Can NFTs be copied? The image can be copied, but the verified ownership on Solana cannot be duplicated. What are NFTs used for? NFTs enable digital ownership for art, gaming items, event tickets, memberships, and collectibles. They provide creators new ways to connect with their audience. How are NFTs different from regular files? While anyone can copy a digital file, NFTs provide verifiable ownership and authenticity on Solana, creating scarcity and provenance for digital items. What's Next Now that you understand NFTs as unique digital assets, the next chapter explores the broader Solana ecosystem. You'll learn about different types of applications and how they leverage Solana's speed and low costs. NFTs demonstrate how digital ownership works on Solana, enabling everything from digital art to gaming assets to event tickets.Previous • Part 6: TokensIntroduction to Solana TokensNext • Part 8: DeFi IntroIntroduction to DeFi on SolanaChapters1.Chapter 1: What is Solana?Solana Basics2.Chapter 2: What is a Wallet?Wallet Basics3.Chapter 3: Understanding Solana Transaction FeesTransaction Fees4.Chapter 4: Sending and Receiving SOLTransfer SOL5.Chapter 5: What is Staking?Staking Rewards6.Chapter 6: Introduction to Solana TokensTokens7.Chapter 7: What are NFTs?NFT Basics8.Chapter 8: Introduction to DeFi on SolanaDeFi Intro9.Chapter 9: Exploring Solana ApplicationsApplications10.Chapter 10: Staying Safe on SolanaSecurity GuideManaged by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 5589,
      "headings": [
        {
          "level": 1,
          "text": "What are NFTs?"
        },
        {
          "level": 1,
          "text": "What are NFTs?"
        },
        {
          "level": 2,
          "text": "What You'll Learn"
        },
        {
          "level": 2,
          "text": "Understanding Non-Fungible"
        },
        {
          "level": 2,
          "text": "Common NFT Use Cases"
        },
        {
          "level": 2,
          "text": "How NFTs Work on Solana"
        },
        {
          "level": 2,
          "text": "NFT Costs on Solana"
        },
        {
          "level": 2,
          "text": "Storing and Managing NFTs"
        },
        {
          "level": 2,
          "text": "Creating NFTs"
        },
        {
          "level": 2,
          "text": "Common Questions"
        },
        {
          "level": 2,
          "text": "What's Next"
        },
        {
          "level": 2,
          "text": "Chapters"
        },
        {
          "level": 3,
          "text": "Digital Art and Collectibles"
        },
        {
          "level": 3,
          "text": "Gaming Assets"
        },
        {
          "level": 3,
          "text": "Music and Media"
        },
        {
          "level": 3,
          "text": "Event Tickets"
        },
        {
          "level": 3,
          "text": "Memberships and Access"
        },
        {
          "level": 3,
          "text": "Technical Structure"
        },
        {
          "level": 3,
          "text": "Why Solana for NFTs?"
        },
        {
          "level": 3,
          "text": "Typical Fees"
        },
        {
          "level": 3,
          "text": "Compressed NFTs"
        },
        {
          "level": 3,
          "text": "Wallet Display"
        },
        {
          "level": 3,
          "text": "Best Practices"
        },
        {
          "level": 3,
          "text": "Basic Process"
        },
        {
          "level": 3,
          "text": "Platforms for Creators"
        },
        {
          "level": 3,
          "text": "Do I own the copyright?"
        },
        {
          "level": 3,
          "text": "Can NFTs be copied?"
        },
        {
          "level": 3,
          "text": "What are NFTs used for?"
        },
        {
          "level": 3,
          "text": "How are NFTs different from regular files?"
        }
      ],
      "scraped_at": "2025-07-12 22:05:53"
    },
    "https://solana.com/learn/introduction-to-defi-on-solana": {
      "url": "https://solana.com/learn/introduction-to-defi-on-solana",
      "title": "Introduction to DeFi on Solana | Solana",
      "description": "Learn about decentralized finance (DeFi) applications on Solana, including trading, lending, and yield opportunities.",
      "content": "Introduction to DeFi on Solana | SolanaLearnDevelopersSolutionsNetworkCommunitySearch8Current chapter: Chapter 8DeFi IntroNextChapters1.Chapter 1: What is Solana?2.Chapter 2: What is a Wallet?3.Chapter 3: Understanding Solana Transaction Fees4.Chapter 4: Sending and Receiving SOL5.Chapter 5: What is Staking?6.Chapter 6: Introduction to Solana Tokens7.Chapter 7: What are NFTs?8.Chapter 8: Introduction to DeFi on Solana9.Chapter 9: Exploring Solana Applications10.Chapter 10: Staying Safe on SolanaIntroduction to DeFi on SolanaLearn about decentralized finance (DeFi) applications on Solana, including trading, lending, and yield opportunities.Introduction to DeFi on Solana Decentralized Finance (DeFi) refers to financial services built on Solana. These applications let you trade, lend, borrow, and earn yield without traditional intermediaries. This chapter introduces the main types of DeFi services available on Solana and how they work. What You'll Learn By the end of this chapter, you'll understand: What DeFi is and how it differs from traditional finance Major types of DeFi applications How to evaluate opportunities and risks Getting started with DeFi safely Common terms and concepts Understanding DeFi DeFi applications use smart contracts (programs on Solana) to provide financial services: Traditional Finance Banks hold your money Institutions set rates Limited hours and access Geographic restrictions Approval processes DeFi You control your assets Markets set rates Available 24/7 globally Open to anyone No approval needed Types of DeFi Applications Decentralized Exchanges (DEXs) Trade tokens directly from your wallet without depositing on an exchange. How they work: Smart contracts hold liquidity pools of token pairs Traders swap against these pools Prices adjust automatically based on supply/demand Liquidity providers earn fees Multiple DEX options exist on Solana with different features and interfaces. Lending and Borrowing Earn interest by lending assets or borrow against collateral. How it works: Lenders deposit assets into pools Borrowers take loans using collateral Interest rates adjust based on utilization Everything is overcollateralized for safety Several established lending protocols operate on Solana. Yield Farming Earn rewards by providing liquidity or staking tokens. Common strategies: Provide liquidity to DEX pools Stake LP tokens for additional rewards Auto-compound earnings Combine multiple protocols Important: Higher yields often mean higher risks Getting Started with DeFi Step 1: Start Small Use amounts you can afford to lose while learning Understand each step before proceeding Keep most funds in your wallet initially Step 2: Try Simple Swaps Visit a DEX aggregator Connect your wallet Select tokens to swap Review the rate and fees Confirm the transaction Step 3: Explore Lending Research lending protocols Check current interest rates Start with stable assets Monitor your positions Step 4: Learn About Liquidity Understand impermanent loss Start with stable pairs Track your returns carefully Key Concepts to Understand Annual Percentage Yield (APY) The yearly return including compound interest. A 10% APY on $1,000 = $100 per year. Total Value Locked (TVL) The total amount deposited in a protocol. Higher TVL often indicates more trust but isn't a guarantee of safety. Impermanent Loss When providing liquidity, token price changes can result in less value than simply holding. Most significant with volatile pairs. Slippage The difference between expected and actual price when trading. Higher for large trades or low liquidity. Collateralization Most DeFi loans require collateral worth more than the loan amount, protecting lenders from defaults. Evaluating DeFi Opportunities Research Protocol Safety How long has it operated? Has it been audited? What's the team's reputation? Check for past incidents Understand the Risks Smart contract bugs Market volatility Impermanent loss Liquidation risks New protocol risks Calculate Real Returns Account for all fees Consider impermanent loss Factor in token price changes Compare to simpler alternatives Safety Best Practices Start Your DeFi Journey Safely Research thoroughly - Understand before you invest Start small - Learn with amounts you can afford to lose Diversify - Don't put everything in one protocol Monitor regularly - DeFi rates and risks change quickly Keep records - Track transactions for taxes Red Flags to Avoid Promises of guaranteed returns Pressure to invest quickly Anonymous teams with no history Unrealistically high yields Complex strategies you don't understand Common Questions Is DeFi safe? DeFi carries risks including smart contract bugs, market volatility, and user error. Start small and only use established protocols. How are yields generated? Yields come from trading fees, borrowing interest, and protocol incentives. Understand the source before investing. What about taxes? DeFi transactions may be taxable events. Keep detailed records and consult tax professionals in your jurisdiction. Can I lose money in DeFi? Yes. Risks include impermanent loss, liquidations, protocol failures, and market downturns. Never invest more than you can afford to lose. What's Next Now that you understand DeFi basics, you're ready to explore specific applications. The next chapter covers the Solana ecosystem in detail, showing you how to discover and evaluate different protocols. Remember: DeFi offers new opportunities but requires personal responsibility. Take time to learn, start small, and always understand the risks before participating.Previous • Part 7: NFT BasicsWhat are NFTs?Next • Part 9: ApplicationsExploring Solana ApplicationsChapters1.Chapter 1: What is Solana?Solana Basics2.Chapter 2: What is a Wallet?Wallet Basics3.Chapter 3: Understanding Solana Transaction FeesTransaction Fees4.Chapter 4: Sending and Receiving SOLTransfer SOL5.Chapter 5: What is Staking?Staking Rewards6.Chapter 6: Introduction to Solana TokensTokens7.Chapter 7: What are NFTs?NFT Basics8.Chapter 8: Introduction to DeFi on SolanaDeFi Intro9.Chapter 9: Exploring Solana ApplicationsApplications10.Chapter 10: Staying Safe on SolanaSecurity GuideManaged by© 2025 Solana Foundation. All rights reserved.SolanaGrantsBreak SolanaMedia KitCareersDisclaimerPrivacy PolicyGet ConnectedBlogNewsletteren© 2025 Solana Foundation. All rights reserved.",
      "content_length": 6382,
      "headings": [
        {
          "level": 1,
          "text": "Introduction to DeFi on Solana"
        },
        {
          "level": 1,
          "text": "Introduction to DeFi on Solana"
        },
        {
          "level": 2,
          "text": "What You'll Learn"
        },
        {
          "level": 2,
          "text": "Understanding DeFi"
        },
        {
          "level": 2,
          "text": "Types of DeFi Applications"
        },
        {
          "level": 2,
          "text": "Getting Started with DeFi"
        },
        {
          "level": 2,
          "text": "Key Concepts to Understand"
        },
        {
          "level": 2,
          "text": "Evaluating DeFi Opportunities"
        },
        {
          "level": 2,
          "text": "Safety Best Practices"
        },
        {
          "level": 2,
          "text": "Common Questions"
        },
        {
          "level": 2,
          "text": "What's Next"
        },
        {
          "level": 2,
          "text": "Chapters"
        },
        {
          "level": 3,
          "text": "Decentralized Exchanges (DEXs)"
        },
        {
          "level": 3,
          "text": "Lending and Borrowing"
        },
        {
          "level": 3,
          "text": "Yield Farming"
        },
        {
          "level": 3,
          "text": "Step 1: Start Small"
        },
        {
          "level": 3,
          "text": "Step 2: Try Simple Swaps"
        },
        {
          "level": 3,
          "text": "Step 3: Explore Lending"
        },
        {
          "level": 3,
          "text": "Step 4: Learn About Liquidity"
        },
        {
          "level": 3,
          "text": "Annual Percentage Yield (APY)"
        },
        {
          "level": 3,
          "text": "Total Value Locked (TVL)"
        },
        {
          "level": 3,
          "text": "Impermanent Loss"
        },
        {
          "level": 3,
          "text": "Slippage"
        },
        {
          "level": 3,
          "text": "Collateralization"
        },
        {
          "level": 3,
          "text": "Research Protocol Safety"
        },
        {
          "level": 3,
          "text": "Understand the Risks"
        },
        {
          "level": 3,
          "text": "Calculate Real Returns"
        },
        {
          "level": 3,
          "text": "Start Your DeFi Journey Safely"
        },
        {
          "level": 3,
          "text": "Red Flags to Avoid"
        },
        {
          "level": 3,
          "text": "Is DeFi safe?"
        },
        {
          "level": 3,
          "text": "How are yields generated?"
        },
        {
          "level": 3,
          "text": "What about taxes?"
        },
        {
          "level": 3,
          "text": "Can I lose money in DeFi?"
        }
      ],
      "scraped_at": "2025-07-12 22:05:55"
    }
  },
  "failed_urls": []
}